   [
    {
        "name": "Caleb Downs",
        "position": "S",
        "team": "Ohio State",
        "stats": {
            "height": "6'0\"",
            "weight": "205",
            "40Time": "4.45"
        },
        "rating": 1,
        "scoutingReport": "Caleb Downs is an elite safety prospect with exceptional instincts, range, and versatility. A former 5-star recruit and 2023 SEC Freshman of the Year at Alabama, he excels in coverage, run defense, and playmaking, with 80+ PFF grades in both since 2023. His 89.4 overall PFF grade ranks fourth among returning FBS safeties. Downs’ athleticism, tackling ability (83 tackles as a high school senior), and ball skills (5 INTs in 2022) make him a potential top-10 pick in 2026. He projects as a dynamic NFL free safety with Pro Bowl upside."
    },
    {
        "name": "Kadyn Proctor",
        "position": "OT",
        "team": "Alabama",
        "stats": {
            "height": "6'7\"",
            "weight": "360",
            "40Time": "5.10"
        },
        "rating": 2,
        "scoutingReport": "Kadyn Proctor is a physically dominant offensive tackle with elite size, power, and athleticism. A 5-star recruit and All-SEC Freshman Team member in 2023, he started all 13 games at left tackle for Alabama as a true freshman. His 6'7\", 360-pound frame and long arms make him a mauler in the run game, while his agility (evident in shot put and basketball in high school) aids in pass protection. Proctor needs to refine his technique and consistency to handle NFL speed rushers but has the tools to be a top-10 pick and potential franchise left tackle in 2026."
    },
    {
        "name": "Dani Dennis-Sutton",
        "position": "EDGE",
        "team": "Penn State",
        "stats": {
            "height": "6'5\"",
            "weight": "272",
            "40Time": "4.68"
        },
        "rating": 3,
        "scoutingReport": "Dani Dennis-Sutton is a high-upside EDGE defender with impressive size, length, and physicality. At 6'5\", 272 lbs, he combines a quick first step with power, excelling as a run defender with the ability to reset the line of scrimmage. His 2023 stats (26 tackles, 3.5 sacks, 6 TFLs) highlight his disruptive potential. However, his pass-rush arsenal needs refinement, as he lacks elite bend and relies heavily on a bull rush. Dennis-Sutton projects as a 4th-round pick in 2025, best suited for even-front defenses as a strong-side end with 6-8 sack potential if he develops counter moves."
    },
    {
        "name": "Peter Woods",
        "position": "DL",
        "team": "Clemson",
        "stats": {
            "height": "6'3\"",
            "weight": "315",
            "40Time": "5.02u"
        },
        "rating": 4,
        "scoutingReport": "Peter Woods is an elite defensive tackle prospect with rare power, agility, and versatility. At 6'3\", 315 lbs, he dominates as a run defender (89.7 PFF run-defense grade since 2023) and flashes dynamic pass-rush ability (14.9% pass-rush win rate). Despite playing out of position at EDGE in 2024, he earned an 83.3 PFF grade, ranking as the highest-graded returning Power Four DT. His quickness off the snap and ability to disrupt both run and pass games draw comparisons to Jalen Carter. Woods projects as a top-5 pick in 2026, capable of anchoring an NFL defensive line with Pro Bowl potential."
    },
    {
        "name": "Cade Klubnik",
        "position": "QB",
        "team": "Clemson",
        "stats": {
            "height": "6'2\"",
            "weight": "205",
            "40Time": "4.65"
        },
        "rating": 5,
        "scoutingReport": "Cade Klubnik is a dynamic dual-threat quarterback with a strong arm and impressive mobility. In 2024, he threw for 3,639 yards, 36 TDs, and 6 INTs, while rushing for 463 yards and 7 TDs, leading Clemson to an ACC title and CFP berth. His 87.7 PFF passing grade ranked fifth among FBS QBs, with 28 big-time throws. Klubnik excels in spread offenses, showing improved pre-snap reads and accuracy against the blitz (57.7% completion, 15 TDs). However, he struggles against elite defenses (e.g., Georgia, South Carolina) and needs to refine post-snap processing. A three-year starter and two-time ACC Championship MVP, he projects as a mid-round 2026 pick with QB2 upside in a system leveraging his athleticism."
    },
    {
        "name": "Arch Manning",
        "position": "QB",
        "team": "Texas",
        "stats": {
            "height": "6'4\"",
            "weight": "215",
            "40Time": "4.70u"
        },
        "rating": 6,
        "scoutingReport": "Arch Manning, a former five-star recruit, combines elite arm talent with surprising athleticism. In limited 2024 action, he rushed for 4 TDs, including a 67-yard score, and showed a strong arm with a 95.2 PFF deep passing grade. At 6'4\", 215 lbs, he has prototypical size and a quick release, but his inexperience as a full-time starter raises questions. Manning’s 2025 season, his first as Texas’ QB1, will be critical. He needs to improve ball security and decision-making under pressure. With his pedigree and tools, he’s a top-10 2026 prospect but may return for 2026 if he needs more seasoning. Projects as a high-upside QB1 with Pro Bowl potential."
    },
    {
        "name": "Francis Mauigoa",
        "position": "OT",
        "team": "Miami",
        "stats": {
            "height": "6'5\"",
            "weight": "315",
            "40Time": "5.30"
        },
        "rating": 8,
        "scoutingReport": "Francis Mauigoa is a dominant right tackle with elite size, power, and athleticism. A two-year starter, he allowed just 1 sack in 534 pass attempts in 2024, protecting QB Cam Ward. At 6'5\", 315 lbs, his 270 lbs of lean muscle and 20.9% body fat earned him a spot on Bruce Feldman’s 'Freaks List.' Mauigoa excels in both gap and zone schemes, with powerful drive blocking and lateral quickness to mirror speed rushers. He needs to improve consistency against polished pass rushers and lower his pad level. A five-star recruit, he projects as a top-5 2026 pick, with All-Pro potential as a franchise tackle."
    },
    {
        "name": "Ruben Bain Jr.",
        "position": "EDGE",
        "team": "Miami",
        "stats": {
            "height": "6'3\"",
            "weight": "260",
            "40Time": "4.70u"
        },
        "rating": 9,
        "scoutingReport": "Ruben Bain Jr. is an explosive EDGE rusher with a relentless motor and versatile skill set. As a true freshman in 2023, he recorded 7.5 sacks and 12.5 TFLs, earning ACC Defensive Rookie of the Year. Despite injuries in 2024, he maintained an 80.0+ PFF pass-rush grade. At 6'3\", 260 lbs, Bain combines quickness off the ball with power, excelling in both run defense and pass rushing. His shorter arm length may limit him against longer NFL tackles, but his hustle and technique draw comparisons to Maxx Crosby. Bain projects as a first-round 2026 pick with double-digit sack potential."
    },
    {
        "name": "DJ McKinney",
        "position": "CB",
        "team": "Colorado",
        "stats": {
            "height": "6'0\"",
            "weight": "185",
            "40Time": "4.50u"
        },
        "rating": 10,
        "scoutingReport": "DJ McKinney is an instinctive cornerback with excellent ball skills and versatility. Transferring from Oklahoma State to Colorado in 2025, he’s expected to shine in Deion Sanders’ secondary. In 2024, he recorded 2 INTs and 8 PBUs, with an 85.0 PFF coverage grade. At 6'0\", 185 lbs, McKinney has adequate size and fluid hips to stick with receivers in man coverage. His aggressive play style leads to occasional penalties, and he needs to improve tackling consistency (10 missed tackles in 2024). McKinney projects as a Day 2 2026 pick, ideal for press-man schemes with potential as a CB2 or nickel."
    },
    {
        "name": "Antonio Williams",
        "position": "WR",
        "team": "Clemson",
        "stats": {
            "height": "5'11\"",
            "weight": "195",
            "40Time": "4.45"
        },
        "rating": 12,
        "scoutingReport": "Antonio Williams is a dynamic slot receiver with crisp route-running and reliable hands. In 2024, he led Clemson with 75 receptions, 904 yards, and 11 TDs, earning First-Team All-ACC honors. His 4.45 40-time and 87.6 PFF receiving grade highlight his explosiveness and ability to separate at all levels. Williams also contributed as a punt returner (9.65 yards/return) and occasional passer (2-for-2, 62 yards, 1 TD). While his 5'11\" frame limits his contested-catch ability, his quickness and versatility make him a Day 2 2026 prospect, projecting as a high-upside slot WR in the NFL."
    },
    {
        "name": "Will Lee III",
        "position": "CB",
        "team": "Texas A&M",
        "stats": {
            "height": "6'0\"",
            "weight": "185",
            "40Time": "4.50u"
        },
        "rating": 13,
        "scoutingReport": "Will Lee III is a versatile cornerback with strong instincts and physicality. Transferring from Kansas State to Texas A&M in 2024, he recorded 3 INTs, 8 PBUs, and an 85.2 PFF coverage grade, excelling in both man and zone schemes. At 6'0\", 185 lbs, his length and quick feet allow him to mirror receivers, while his 41 tackles show run-support tenacity. Lee needs to reduce penalties (4 in 2024) and improve tackling consistency (6 missed tackles). A former JUCO All-American, he projects as a mid-round 2026 pick, ideal as a CB2 or nickel in press-heavy defenses."
    },
    {
        "name": "LaNorris Sellers",
        "position": "QB",
        "team": "South Carolina",
        "stats": {
            "height": "6'3\"",
            "weight": "230",
            "40Time": "4.60u"
        },
        "rating": 14,
        "scoutingReport": "LaNorris Sellers is a dual-threat quarterback with elite playmaking ability and a live arm. In 2024, he threw for 2,256 yards, 17 TDs, and 7 INTs, while rushing for 655 yards and 7 TDs, earning an 80.1 PFF offensive grade. His 6'3\", 230-pound frame and sack-avoidance skills (6.2% sack rate) make him a nightmare for defenses. Sellers’ deep-ball accuracy (47.1% on 20+ yard throws) and improvisational flair draw comparisons to Jalen Hurts. However, he must improve pre-snap reads and consistency (58.7% completion). A Heisman contender, he’s a first-round 2026 prospect with QB1 potential."
    },
    {
        "name": "Garrett Nussmeier",
        "position": "QB",
        "team": "LSU",
        "stats": {
            "height": "6'2\"",
            "weight": "200",
            "40Time": "4.82"
        },
        "rating": 15,
        "scoutingReport": "Garrett Nussmeier is a gunslinger with a cannon arm and clutch playmaking ability. In 2024, he threw for 4,052 yards, 29 TDs, and 12 INTs, leading LSU to a 9-4 record with an 80.0 QBR (10th nationally). His 88.5 PFF passing grade and 395-yard Texas Bowl performance showcase his arm talent and poise. At 6'2\", 200 lbs, he’s durable despite a lean frame, playing through a 2024 shoulder injury. Nussmeier’s Brett Favre-esque risk-taking (12 INTs) and inconsistent footwork need coaching. A first-round 2026 prospect, he projects as a QB1 in a vertical offense."
    },
    {
        "name": "Nicholas Singleton",
        "position": "RB",
        "team": "Penn State",
        "stats": {
            "height": "6'0\"",
            "weight": "225",
            "40Time": "4.50u"
        },
        "rating": 15,
        "scoutingReport": "Nicholas Singleton is a powerful running back with breakaway speed and versatility. In 2024, he rushed for 1,125 yards and 10 TDs, adding 28 receptions for 285 yards and 3 TDs, earning an 85.7 PFF rushing grade. At 6'0\", 225 lbs, his physicality (32 forced missed tackles) and vision shine in Penn State’s zone-heavy scheme. Singleton’s pass-blocking (78.2 PFF grade) enhances his three-down potential. He’s recovering from a minor 2024 knee injury, not an ACL tear. A top-100 2026 prospect, he projects as a starting RB with RB1 upside."
    },
    {
        "name": "Jeremiyah Love",
        "position": "RB",
        "team": "Notre Dame",
        "stats": {
            "height": "5'11\"",
            "weight": "205",
            "40Time": "4.42"
        },
        "rating": 16,
        "scoutingReport": "Jeremiyah Love is an explosive running back with elite speed and versatility. In 2024, he rushed for 1,057 yards and 12 TDs, averaging 6.2 yards per carry, while adding 22 receptions for 245 yards and 2 TDs, earning an 87.4 PFF rushing grade. His 4.42 40-time and 38-inch vertical highlight his home-run ability (15 runs of 20+ yards). Love’s vision and agility make him a threat in both zone and gap schemes, though he needs to improve pass-blocking (65.2 PFF grade). A top-100 2026 prospect, he projects as a three-down RB with RB1 potential."
    },
    {
        "name": "TJ Parker",
        "position": "EDGE",
        "team": "Clemson",
        "stats": {
            "height": "6'3\"",
            "weight": "260",
            "40Time": "4.65u"
        },
        "rating": 17,
        "scoutingReport": "TJ Parker is a powerful EDGE rusher with a high motor and versatile skill set. In 2024, he recorded 5.5 sacks, 11 TFLs, and 2 forced fumbles, earning an 82.3 PFF pass-rush grade. At 6'3\", 260 lbs, Parker combines a quick first step with strength, excelling as a 5-technique in Clemson’s hybrid front. His ability to convert speed to power makes him effective against the run (78.9 PFF run-defense grade). While his bend is average, his relentless effort and improving hand usage project him as a Day 2 2026 pick, ideal for 4-3 defenses with 8-10 sack potential."
    },
    {
        "name": "Drew Allar",
        "position": "QB",
        "team": "Penn State",
        "stats": {
            "height": "6'5\"",
            "weight": "235",
            "40Time": "4.85"
        },
        "rating": 18,
        "scoutingReport": "Drew Allar is a prototypical pocket passer with elite arm strength and improving decision-making. In 2024, he threw for 3,021 yards, 25 TDs, and 7 INTs, with an 86.5 PFF passing grade, leading Penn State to a 12-2 record. His 6'5\", 235-pound frame and ability to deliver 50+ yard throws (47.8% completion on deep balls) make him a fit for pro-style offenses. Allar’s limited mobility (4.85 40-time) and occasional hesitancy under pressure (7.1% sack rate) are concerns. A first-round 2026 prospect, he projects as a QB1 with high-end starter potential in a vertical passing system."
    },
    {
        "name": "CJ Allen",
        "position": "LB",
        "team": "Georgia",
        "stats": {
            "height": "6'1\"",
            "weight": "235",
            "40Time": "4.60u"
        },
        "rating": 19,
        "scoutingReport": "CJ Allen is a hard-hitting, instinctive linebacker with sideline-to-sideline range. In 2024, he led Georgia with 85 tackles, 4.5 TFLs, and 2 INTs, earning an 84.7 PFF coverage grade. At 6'1\", 235 lbs, his compact frame and quick trigger allow him to excel in run defense (80.1 PFF run-defense grade) and cover tight ends in man coverage. Allen’s aggressive play style leads to occasional overpursuit, and he needs to refine his pass-rush moves (1.5 sacks). A former five-star recruit, he projects as a Day 2 2026 pick, ideal as a MIKE or WILL with three-down starter potential."
    },
    {
        "name": "Mansoor Delane",
        "position": "CB",
        "team": "LSU",
        "stats": {
            "height": "6'1\"",
            "weight": "190",
            "40Time": "4.45"
        },
        "rating": 20,
        "scoutingReport": "Mansoor Delane is a versatile cornerback with elite ball skills and physicality. Transferring from Virginia Tech to LSU for 2025, he recorded 4 INTs and 10 PBUs in 2024, with an 88.2 PFF coverage grade. At 6'1\", 190 lbs, his length and 4.45 speed allow him to excel in press-man coverage, while his 45 tackles show run-support ability. Delane’s occasional overaggressiveness leads to penalties (3 in 2024), and he needs to improve zone awareness. A former four-star recruit, he projects as a first-round 2026 pick, with CB1 potential in man-heavy schemes."
    },
    {
        "name": "Deontate Lawson",
        "position": "LB",
        "team": "Alabama",
        "stats": {
            "height": "6'2\"",
            "weight": "235",
            "40Time": "4.65u"
        },
        "rating": 21,
        "scoutingReport": "Deontate Lawson is a versatile linebacker with elite instincts and playmaking ability. In 2024, he led Alabama with 92 tackles, 8 TFLs, 3 sacks, and 2 INTs, earning an 85.6 PFF overall grade. At 6'2\", 235 lbs, his sideline-to-sideline range and quick trigger make him a three-down threat, excelling in run defense (83.4 PFF run-defense grade) and coverage (7 PBUs). Lawson’s leadership as a defensive signal-caller and ability to shed blocks highlight his MIKE linebacker fit. He needs to improve pass-rush consistency (12 pressures). A Day 2 2026 prospect, he projects as a starting NFL linebacker with Pro Bowl potential."
    },
    {
        "name": "Domani Jackson",
        "position": "CB",
        "team": "Alabama",
        "stats": {
            "height": "6'1\"",
            "weight": "190",
            "40Time": "4.40"
        },
        "rating": 21,
        "scoutingReport": "Domani Jackson is an elite cornerback with lockdown potential. Transferring from USC to Alabama in 2024, he recorded 3 INTs, 9 PBUs, and an 87.9 PFF coverage grade, limiting receivers to a 45.2% catch rate in man coverage. At 6'1\", 190 lbs, his 4.40 speed and fluid hips allow him to mirror top receivers, while his 38 tackles show physicality. Jackson needs to reduce penalties (4 in 2024) and improve zone awareness. A former five-star recruit, he projects as a first-round 2026 pick, with CB1 upside in press-man schemes."
    },
    {
        "name": "Dillon Thieneman",
        "position": "S",
        "team": "Oregon",
        "stats": {
            "height": "6'0\"",
            "weight": "205",
            "40Time": "4.50u"
        },
        "rating": 22,
        "scoutingReport": "Dillon Thieneman is a ball-hawking safety with exceptional instincts and versatility. Transferring from Purdue to Oregon for 2025, he led the Big Ten with 6 INTs in 2024, adding 104 tackles and an 89.1 PFF coverage grade. At 6'0\", 205 lbs, his range and tackling ability (9.8% missed tackle rate) make him a fit for both free and strong safety roles. Thieneman’s ability to read quarterbacks and close on the ball is elite, but he needs to improve man-coverage skills against slot receivers. A top-50 2026 prospect, he projects as a starting NFL safety with All-Pro potential."
    },
    {
        "name": "Avieon Terrell",
        "position": "CB",
        "team": "Clemson",
        "stats": {
            "height": "5'11\"",
            "weight": "185",
            "40Time": "4.45u"
        },
        "rating": 22,
        "scoutingReport": "Avieon Terrell is a sticky cornerback with quick feet and strong ball skills. In 2024, he recorded 2 INTs, 7 PBUs, and an 86.3 PFF coverage grade, excelling in Clemson’s man-heavy scheme. At 5'11\", 185 lbs, his agility and 4.45 speed allow him to stay glued to receivers, while his 41 tackles show run-support willingness. Terrell’s smaller frame can be a liability against bigger WRs, and he needs to improve tackling consistency (8 missed tackles). Brother of NFL CB AJ Terrell, he projects as a Day 2 2026 pick, ideal as a nickel or CB2 in zone schemes."
    },
    {
        "name": "Sonny Styles",
        "position": "LB",
        "team": "Ohio State",
        "stats": {
            "height": "6'4\"",
            "weight": "245",
            "40Time": "4.60u"
        },
        "rating": 23,
        "scoutingReport": "Sonny Styles is a hybrid linebacker with elite size and athleticism. Transitioning from safety to linebacker in 2024, he recorded 74 tackles, 6 TFLs, 2 sacks, and an 82.7 PFF run-defense grade. At 6'4\", 245 lbs, his 4.60 speed and length make him a matchup nightmare, capable of covering tight ends (84.1 PFF coverage grade) and stopping the run. Styles’ inexperience at LB shows in occasional misreads, and he needs to develop pass-rush moves (10 pressures). A former five-star recruit, he projects as a top-50 2026 pick, with 3-4 OLB or MIKE versatility and Pro Bowl upside."
    },
    {
        "name": "Emmanuel Pregnon",
        "position": "IOL",
        "team": "Oregon",
        "stats": {
            "height": "6'5\"",
            "weight": "315",
            "40Time": "5.10u"
        },
        "rating": 24,
        "scoutingReport": "Emmanuel Pregnon is a powerful interior offensive lineman with a strong anchor and versatility. Transferring from USC to Oregon for 2025, he started all 13 games at guard in 2024, earning an 82.4 PFF run-blocking grade. At 6'5\", 315 lbs, his size and grip strength allow him to dominate in the run game, while his quick feet (1.75 10-yard split) aid in pass protection (2 sacks allowed). Pregnon’s recovery from a minor 2024 knee injury (not an ACL tear) is on track. He needs to improve hand placement to counter NFL speed rushers. A Day 2 2026 prospect, he projects as a starting guard or center."
    },
    {
        "name": "Harold Perkins Jr.",
        "position": "LB",
        "team": "LSU",
        "stats": {
            "height": "6'1\"",
            "weight": "225",
            "40Time": "4.55u"
        },
        "rating": 25,
        "scoutingReport": "Harold Perkins Jr. is an explosive linebacker with elite playmaking ability. In 2024, he recorded 67 tackles, 8.5 TFLs, 5.5 sacks, and an 85.9 PFF pass-rush grade, thriving as a hybrid LB/EDGE. At 6'1\", 225 lbs, his 4.55 speed and quickness make him a three-down threat, effective in coverage (83.2 PFF coverage grade) and blitzing (15 pressures). Perkins’ smaller frame can be a liability against bigger blockers, and he needs to refine run-fit discipline. A former five-star recruit, he projects as a top-20 2026 pick, ideal as a WILL or 3-4 OLB with All-Pro upside."
    },
    {
        "name": "Jordyn Tyson",
        "position": "WR",
        "team": "Arizona State",
        "stats": {
            "height": "6'2\"",
            "weight": "195",
            "40Time": "4.45u"
        },
        "rating": 25,
        "scoutingReport": "Jordyn Tyson is a dynamic wide receiver with crisp route-running and big-play ability. In 2024, he led Arizona State with 75 receptions, 1,149 yards, and 10 TDs, earning First-Team All-Big 12 honors and an 88.7 PFF receiving grade. At 6'2\", 195 lbs, his 4.45 speed and 37-inch vertical make him a deep threat (18.2 yards per catch). Tyson’s reliable hands (3 drops) and ability to win at all levels shine in the slot or outside. He needs to add strength for contested catches. A top-50 2026 prospect, he projects as a starting WR with WR2 upside."
    },
    {
        "name": "Tacario Davis",
        "position": "CB",
        "team": "Washington",
        "stats": {
            "height": "6'4\"",
            "weight": "195",
            "40Time": "4.50"
        },
        "rating": 26,
        "scoutingReport": "Tacario Davis is a lanky cornerback with elite length and ball skills. Transferring from Arizona to Washington for 2025, he recorded 3 INTs, 12 PBUs, and an 87.1 PFF coverage grade in 2024. At 6'4\", 195 lbs, his 34-inch arms and 4.50 speed allow him to disrupt passing lanes and match big receivers. Davis excels in press coverage but needs to improve tackling (10 missed tackles) and add bulk to handle NFL physicality. His Senior Bowl performance boosted his stock. A top-50 2026 prospect, he projects as a CB1 in man-heavy schemes with shutdown potential."
    },
    {
        "name": "Anthony Hill Jr.",
        "position": "LB",
        "team": "Texas",
        "stats": {
            "height": "6'3\"",
            "weight": "235",
            "40Time": "4.60u"
        },
        "rating": 27,
        "scoutingReport": "Anthony Hill Jr. is a versatile linebacker with sideline-to-sideline range and playmaking flair. In 2024, he recorded 79 tackles, 7 TFLs, 3.5 sacks, and an 84.3 PFF run-defense grade, thriving in Texas’ 4-2-5 scheme. At 6'3\", 235 lbs, his 4.60 speed and instincts allow him to cover tight ends (82.9 PFF coverage grade) and blitz effectively (12 pressures). Hill’s aggressive style leads to occasional overpursuit, and he needs to improve block-shedding. A former five-star recruit, he projects as a Day 2 2026 pick, ideal as a MIKE or SAM with three-down starter potential."
    },
    {
        "name": "Denzel Boston",
        "position": "WR",
        "team": "Washington",
        "stats": {
            "height": "6'1\"",
            "weight": "195",
            "40Time": "4.50u"
        },
        "rating": 28,
        "scoutingReport": "Denzel Boston is a polished wide receiver with reliable hands and explosive playmaking ability. In 2024, he led Washington with 84 receptions, 1,021 yards, and 14 TDs, earning an 86.5 PFF receiving grade. At 6'1\", 195 lbs, his 4.50 speed and precise route-running make him a threat on intermediate and deep routes (16.8 yards per catch). Boston’s ability to track the ball and win 50-50 balls (65% contested catch rate) boosts his stock. He needs to improve after-catch elusiveness. A Day 2 2026 prospect, he projects as a starting WR with WR2 potential."
    },
    {
        "name": "Eli Holstein",
        "position": "QB",
        "team": "Pittsburgh",
        "stats": {
            "height": "6'4\"",
            "weight": "225",
            "40Time": "4.80u"
        },
        "rating": 29,
        "scoutingReport": "Eli Holstein is a pro-style quarterback with a strong arm and improving pocket presence. In 2024, he threw for 2,595 yards, 21 TDs, and 8 INTs at Pittsburgh, earning an 83.2 PFF passing grade. At 6'4\", 225 lbs, his size and ability to deliver accurate deep balls (46.3% completion on 20+ yard throws) fit vertical offenses. Holstein’s 2024 performance included a 344-yard, 4-TD game against Syracuse. He needs to improve pre-snap reads and reduce forced throws (8 INTs). A former Alabama transfer, he projects as a Day 3 2026 pick with QB2 upside."
    },
    {
        "name": "Zachariah Branch",
        "position": "WR",
        "team": "Georgia",
        "stats": {
            "height": "5'10\"",
            "weight": "175",
            "40Time": "4.35"
        },
        "rating": 30,
        "scoutingReport": "Zachariah Branch is an electric wide receiver and return specialist with game-breaking speed. Transferring from USC to Georgia for 2025, he recorded 47 receptions for 664 yards, 5 TDs, and an 87.9 PFF receiving grade in 2024, plus 14.2 yards per punt return. At 5'10\", 175 lbs, his 4.35 40-time and elite agility (4.05 shuttle) make him a YAC threat (8.7 yards after catch). Branch’s slight frame limits contested catches, and he needs to expand his route tree. A top-50 2026 prospect, he projects as a slot WR and returner with WR2 potential."
    },
    {
        "name": "Blake Miller",
        "position": "OT",
        "team": "Clemson",
        "stats": {
            "height": "6'6\"",
            "weight": "315",
            "40Time": "5.15"
        },
        "rating": 31,
        "scoutingReport": "Blake Miller is a polished offensive tackle with elite size and technique. A three-year starter at Clemson, he allowed just 2 sacks in 1,052 pass-blocking snaps since 2023, earning an 84.6 PFF pass-blocking grade in 2024. At 6'6\", 315 lbs, his long arms and strong anchor make him a wall against power rushers, while his agility shines in zone schemes. Miller’s run-blocking (82.1 PFF grade) and durability (33 starts) boost his stock. He needs to improve recovery against speed rushers. A top-20 2026 prospect, he projects as a starting LT with All-Pro potential."
    },
    {
        "name": "Caleb Lomu",
        "position": "OT",
        "team": "Utah",
        "stats": {
            "height": "6'5\"",
            "weight": "305",
            "40Time": "5.20u"
        },
        "rating": 31,
        "scoutingReport": "Caleb Lomu is a promising offensive tackle with raw athleticism and a high ceiling. A 2024 starter at Utah, he earned a 79.8 PFF run-blocking grade, showcasing power in gap schemes. At 6'5\", 305 lbs, his frame and quick feet (1.78 10-yard split) allow him to mirror edge rushers, though he allowed 3 sacks in 2024. Lomu’s technique is developing, particularly in hand placement and sustaining blocks. A former four-star recruit, he projects as a Day 3 2026 pick, with potential to be a starting RT or swing tackle if he refines his fundamentals."
    },
    {
        "name": "Keon Sabb",
        "position": "S",
        "team": "Alabama",
        "stats": {
            "height": "6'1\"",
            "weight": "205",
            "40Time": "4.55u"
        },
        "rating": 32,
        "scoutingReport": "Keon Sabb is a hard-hitting safety with strong instincts and versatility. Transferring from Michigan to Alabama in 2024, he recorded 68 tackles, 4 INTs, and an 85.3 PFF coverage grade. At 6'1\", 205 lbs, his 4.55 speed and physicality shine in run support (80.9 PFF run-defense grade) and deep coverage. Sabb’s ability to play in the box or as a single-high safety makes him scheme-versatile. He needs to reduce missed tackles (12 in 2024) and improve man-coverage skills. A Day 2 2026 prospect, he projects as a starting SS with Pro Bowl upside."
    },
    {
        "name": "Keldrick Faulk",
        "position": "EDGE",
        "team": "Auburn",
        "stats": {
            "height": "6'6\"",
            "weight": "255",
            "40Time": "4.70u"
        },
        "rating": 33,
        "scoutingReport": "Keldrick Faulk is a long, athletic EDGE rusher with upside as a pass-rush specialist. In 2024, he recorded 4.5 sacks, 9 TFLs, and an 80.7 PFF pass-rush grade at Auburn. At 6'6\", 255 lbs, his 34-inch arms and quick first step disrupt tackles, though his 15.2% pass-rush win rate needs consistency. Faulk’s run defense (78.4 PFF grade) is solid, but he struggles against heavier linemen. A former four-star recruit, he projects as a Day 3 2026 pick, ideal as a 3-4 OLB or situational pass rusher with 6-8 sack potential."
    },
    {
        "name": "Caleb Banks",
        "position": "DL",
        "team": "Florida",
        "stats": {
            "height": "6'6\"",
            "weight": "315",
            "40Time": "5.05u"
        },
        "rating": 34,
        "scoutingReport": "Caleb Banks is a massive defensive lineman with power and versatility. In 2024, he recorded 28 tackles, 5 TFLs, 3 sacks, and an 81.4 PFF run-defense grade at Florida. At 6'6\", 315 lbs, his ability to play 3-tech or nose tackle makes him scheme-versatile, clogging run lanes and holding double teams. Banks’ 12 pressures show pass-rush potential, but he needs to improve quickness off the snap. A former three-star recruit, he projects as a Day 3 2026 pick, with potential as a rotational DT or starting 0-tech in odd fronts."
    },
    {
        "name": "Matayo Uiagalelei",
        "position": "EDGE",
        "team": "Oregon",
        "stats": {
            "height": "6'5\"",
            "weight": "265",
            "40Time": "4.75u"
        },
        "rating": 35,
        "scoutingReport": "Matayo Uiagalelei is a high-upside EDGE rusher with elite length and athleticism. In 2024, he recorded 6 sacks, 10 TFLs, and an 83.1 PFF pass-rush grade at Oregon. At 6'5\", 265 lbs, his 34-inch arms and explosive first step make him a disruptive 5-technique or stand-up OLB. Uiagalelei’s run defense (79.6 PFF grade) is improving, but he needs to develop counter moves to boost his 14.8% pass-rush win rate. A former five-star recruit, he projects as a Day 2 2026 pick, with 8-10 sack potential in a 3-4 scheme."
    },
    {
        "name": "Jalon Kilgore",
        "position": "S",
        "team": "South Carolina",
        "stats": {
            "height": "6'2\"",
            "weight": "210",
            "40Time": "4.50u"
        },
        "rating": 36,
        "scoutingReport": "Jalon Kilgore is a rangy safety with strong ball skills and tackling ability. In 2024, he recorded 78 tackles, 3 INTs, 6 PBUs, and an 84.9 PFF coverage grade at South Carolina. At 6'2\", 210 lbs, his 4.50 speed and physicality make him effective as a box safety or in split-zone coverage. Kilgore’s 8.7% missed tackle rate and ability to blitz (2 sacks) add versatility. He needs to improve deep-zone discipline. A former four-star recruit, he projects as a Day 3 2026 pick, with potential as a starting SS or nickel."
    },
    {
        "name": "Fa'alili Fa'amoe",
        "position": "OT",
        "team": "Wake Forest",
        "stats": {
            "height": "6'5\"",
            "weight": "315",
            "40Time": "5.25u"
        },
        "rating": 37,
        "scoutingReport": "Fa'alili Fa'amoe is a sturdy offensive tackle with a strong anchor and developing technique. A 2024 starter at Wake Forest, he earned a 78.9 PFF pass-blocking grade, allowing 2 sacks in 487 pass snaps. At 6'5\", 315 lbs, his long arms and power make him effective in the run game (80.2 PFF run-blocking grade), particularly in gap schemes. Fa'amoe’s footwork needs refinement to handle NFL speed rushers. A former three-star recruit, he projects as a Day 3 2026 pick, with potential as a starting RT or guard."
    },
    {
        "name": "Elijah Sarratt",
        "position": "WR",
        "team": "Indiana",
        "stats": {
            "height": "6'2\"",
            "weight": "205",
            "40Time": "4.45"
        },
        "rating": 39,
        "scoutingReport": "Elijah Sarratt is a versatile wide receiver with reliable hands and strong route-running. In 2024, he led Indiana with 82 receptions, 1,162 yards, and 9 TDs, earning an 87.3 PFF receiving grade. At 6'2\", 205 lbs, his 4.45 speed and 36-inch vertical allow him to win at all levels, particularly on intermediate routes (68% catch rate). Sarratt’s physicality shines in run-blocking (80.1 PFF grade) and contested catches (60% success rate). He needs to improve YAC elusiveness. A Day 2 2026 prospect, he projects as a starting X or Z receiver with WR2 upside."
    },
    {
        "name": "Max Klare",
        "position": "TE",
        "team": "Ohio State",
        "stats": {
            "height": "6'4\"",
            "weight": "250",
            "40Time": "4.75u"
        },
        "rating": 40,
        "scoutingReport": "Max Klare is a well-rounded tight end with strong receiving and blocking skills. Transferring from Purdue to Ohio State for 2025, he recorded 44 receptions for 582 yards and 5 TDs in 2024, earning an 82.9 PFF receiving grade. At 6'4\", 250 lbs, his 4.75 speed and reliable hands make him a mismatch in the passing game, while his 78.6 PFF run-blocking grade suits in-line roles. Klare needs to improve route separation against man coverage. A Day 3 2026 prospect, he projects as a starting TE with Y-TE versatility."
    },
    {
        "name": "Dontay Corleone",
        "position": "DL",
        "team": "Cincinnati",
        "stats": {
            "height": "6'2\"",
            "weight": "320",
            "40Time": "5.05u"
        },
        "rating": 41,
        "scoutingReport": "Dontay Corleone, nicknamed 'The Godfather,' is a dominant nose tackle with elite run-stopping ability. In 2024, he recorded 38 tackles, 6.5 TFLs, 3 sacks, and an 86.4 PFF run-defense grade at Cincinnati. At 6'2\", 320 lbs, his 40-inch vertical and leverage make him a double-team magnet, while his 12 pressures show pass-rush potential. Corleone’s 2024 All-AAC First Team honors highlight his impact. He needs to develop counter moves to boost his 10.8% pass-rush win rate. A Day 2 2026 prospect, he projects as a starting 0-tech or 1-tech DT."
    },
    {
        "name": "Thaddeus Dixon",
        "position": "CB",
        "team": "North Carolina",
        "stats": {
            "height": "6'0\"",
            "weight": "190",
            "40Time": "4.50u"
        },
        "rating": 42,
        "scoutingReport": "Thaddeus Dixon is a physical cornerback with strong instincts and ball skills. In 2024, he recorded 3 INTs, 8 PBUs, and an 84.7 PFF coverage grade at North Carolina, limiting receivers to a 48.3% catch rate. At 6'0\", 190 lbs, his 4.50 speed and physicality shine in press coverage, while his 42 tackles show run-support ability. Dixon needs to improve zone awareness and reduce penalties (5 in 2024). A former JUCO standout, he projects as a Day 3 2026 pick, with potential as a CB2 or nickel in man-heavy schemes."
    },
    {
        "name": "Evan Stewart",
        "position": "WR",
        "team": "Oregon",
        "stats": {
            "height": "6'0\"",
            "weight": "185",
            "40Time": "4.40"
        },
        "rating": 43,
        "scoutingReport": "Evan Stewart is an explosive wide receiver with elite speed and YAC ability. Transferring from Texas A&M to Oregon in 2024, he recorded 61 receptions, 914 yards, and 8 TDs, earning an 88.1 PFF receiving grade. At 6'0\", 185 lbs, his 4.40 40-time, 41-inch vertical, and 6.82 3-cone highlight his athleticism. Stewart’s ability to win deep (18.9 yards per catch) and after the catch (7.8 YAC) makes him a versatile X or Z. He needs to add strength for physical corners. A top-50 2026 prospect, he projects as a starting WR with WR1 upside."
    },
    {
        "name": "LT Overton",
        "position": "EDGE",
        "team": "Alabama",
        "stats": {
            "height": "6'5\"",
            "weight": "265",
            "40Time": "4.70u"
        },
        "rating": 44,
        "scoutingReport": "LT Overton is a versatile EDGE rusher with a high motor and athletic upside. Transferring from Texas A&M to Alabama in 2024, he recorded 5 sacks, 8 TFLs, and an 82.3 PFF pass-rush grade. At 6'5\", 265 lbs, his 4.70 speed and long arms disrupt tackles, while his 78.9 PFF run-defense grade shows strength at the point of attack. Overton’s 14.2% pass-rush win rate needs consistency, and he must develop counter moves. A former five-star recruit, he projects as a Day 2 2026 pick, ideal for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Carson Beck",
        "position": "QB",
        "team": "Miami",
        "stats": {
            "height": "6'4\"",
            "weight": "220",
            "40Time": "4.85"
        },
        "rating": 45,
        "scoutingReport": "Carson Beck is a polished pocket passer with strong arm talent and decision-making. Transferring from Georgia to Miami for 2025, he threw for 3,941 yards, 32 TDs, and 12 INTs in 2024, earning an 86.7 PFF passing grade. At 6'4\", 220 lbs, his 4.85 40-time and ability to layer throws (47.1% completion on 20+ yard passes) fit pro-style offenses. Beck’s poise under pressure (6.8% sack rate) is a strength, but he needs to improve mobility. A top-50 2026 prospect, he projects as a QB1 with high-end starter potential."
    },
    {
        "name": "DeMonte Capehart",
        "position": "DT",
        "team": "Clemson",
        "stats": {
            "height": "6'5\"",
            "weight": "305",
            "40Time": "5.10u"
        },
        "rating": 45,
        "scoutingReport": "DeMonte Capehart is a powerful defensive tackle with a strong anchor and improving pass-rush skills. In 2024, he recorded 25 tackles, 4 TFLs, 2 sacks, and an 80.4 PFF run-defense grade at Clemson. At 6'5\", 305 lbs, his size and leverage make him a run-stuffer, while his 10 pressures show developing pass-rush ability. Capehart’s quickness off the snap is average, and he needs to boost his 9.8% pass-rush win rate. A former five-star recruit, he projects as a Day 3 2026 pick, with potential as a rotational 3-tech or nose tackle."
    },
    {
        "name": "Tristan Leigh",
        "position": "OT",
        "team": "Clemson",
        "stats": {
            "height": "6'6\"",
            "weight": "315",
            "40Time": "5.20"
        },
        "rating": 46,
        "scoutingReport": "Tristan Leigh is a massive offensive tackle with strong fundamentals and versatility. A 2024 starter at Clemson, he earned an 83.1 PFF pass-blocking grade, allowing 1 sack in 612 pass snaps. At 6'6\", 315 lbs, his long arms and power shine in run-blocking (81.7 PFF grade), particularly in zone schemes. Leigh, 23 in 2026, is younger than noted (not 25). His foot speed needs improvement to handle elite edge rushers. A former five-star recruit, he projects as a Day 2 2026 pick, with potential as a starting LT or RT."
    },
    {
        "name": "Parker Brailsford",
        "position": "IOL",
        "team": "Alabama",
        "stats": {
            "height": "6'2\"",
            "weight": "290",
            "40Time": "5.00u"
        },
        "rating": 47,
        "scoutingReport": "Parker Brailsford is a technically sound interior offensive lineman with elite agility. Transferring from Washington to Alabama in 2024, he earned an 85.2 PFF run-blocking grade at center, anchoring a top-10 rushing attack. At 6'2\", 290 lbs, his 5.00 speed and quickness (1.68 10-yard split) make him ideal for zone schemes, while his 78.9 PFF pass-blocking grade shows pocket stability. Brailsford needs to add strength to handle NFL nose tackles. A Rimington Trophy finalist, he projects as a Day 2 2026 pick, with starting center or guard potential."
    },
    {
        "name": "Austin Barber",
        "position": "OT",
        "team": "Florida",
        "stats": {
            "height": "6'6\"",
            "weight": "315",
            "40Time": "5.25u"
        },
        "rating": 48,
        "scoutingReport": "Austin Barber is a physical offensive tackle with strong run-blocking ability. A 2024 starter at Florida, he earned an 81.7 PFF run-blocking grade, excelling in gap schemes. At 6'6\", 315 lbs, his size and grip strength anchor against power rushers, though he allowed 3 sacks in 2024 (78.4 PFF pass-blocking grade). Barber’s footwork needs refinement to counter speed rushers, and his 5.25 40-time limits recovery speed. A former four-star recruit, he projects as a Day 3 2026 pick, with potential as a starting RT or swing tackle."
    },
    {
        "name": "Zeke Berry",
        "position": "CB",
        "team": "Michigan",
        "stats": {
            "height": "6'0\"",
            "weight": "190",
            "40Time": "4.45u"
        },
        "rating": 49,
        "scoutingReport": "Zeke Berry is a versatile cornerback with quick feet and strong instincts. In 2024, he recorded 2 INTs, 6 PBUs, and an 83.9 PFF coverage grade at Michigan, showing promise in both man and zone schemes. At 6'0\", 190 lbs, his 4.45 speed and 34-inch arms allow him to disrupt receivers at the catch point. Berry’s role expanded late in 2024 due to injuries, but he needs to improve tackling (10 missed tackles) and consistency in press coverage. A former four-star recruit, he projects as a Day 3 2026 pick, ideal as a nickel or CB2."
    },
    {
        "name": "Tyreak Sapp",
        "position": "EDGE",
        "team": "Florida",
        "stats": {
            "height": "6'3\"",
            "weight": "260",
            "40Time": "4.75u"
        },
        "rating": 51,
        "scoutingReport": "Tyreak Sapp is a powerful EDGE rusher with a high motor and run-stopping ability. In 2024, he recorded 4 sacks, 7.5 TFLs, and an 81.2 PFF run-defense grade at Florida. At 6'3\", 260 lbs, his strength and leverage make him effective against the run, while his 12 pressures show developing pass-rush skills. Sapp’s 4.75 speed limits his bend around the edge, and he needs to expand his pass-rush arsenal (11.9% win rate). A former four-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Earnest Greene III",
        "position": "OT",
        "team": "Georgia",
        "stats": {
            "height": "6'4\"",
            "weight": "320",
            "40Time": "5.30u"
        },
        "rating": 52,
        "scoutingReport": "Earnest Greene III is a massive offensive tackle with elite power and anchor strength. A 2024 starter at left tackle for Georgia, he earned an 83.4 PFF run-blocking grade, dominating in gap schemes. At 6'4\", 320 lbs, his ability to stonewall power rushers (1 sack allowed in 2024) highlights his 79.8 PFF pass-blocking grade. Greene’s lateral agility needs improvement to handle speed rushers, and his 5.30 40-time reflects limited mobility. A former five-star recruit, he projects as a Day 2 2026 pick, with starting LT or guard potential."
    },
    {
        "name": "Kenyon Sadiq",
        "position": "TE",
        "team": "Oregon",
        "stats": {
            "height": "6'3\"",
            "weight": "245",
            "40Time": "4.65"
        },
        "rating": 53,
        "scoutingReport": "Kenyon Sadiq is an athletic tight end with strong receiving skills and blocking upside. In 2024, he recorded 38 receptions for 512 yards and 4 TDs at Oregon, earning an 82.1 PFF receiving grade. At 6'3\", 245 lbs, his 4.65 speed and 35-inch vertical create mismatches against linebackers, while his 77.9 PFF run-blocking grade suits in-line duties. Sadiq’s route-running needs polish to beat man coverage, and he must add strength for NFL blocking. A former four-star recruit, he projects as a Day 3 2026 pick, with H-back or Y-TE potential."
    },
    {
        "name": "Kevin Concepcion",
        "position": "WR",
        "team": "Texas A&M",
        "stats": {
            "height": "5'11\"",
            "weight": "185",
            "40Time": "4.50u"
        },
        "rating": 54,
        "scoutingReport": "Kevin Concepcion is a shifty slot receiver with elite quickness and reliable hands. Transferring from NC State to Texas A&M for 2025, he recorded 71 receptions, 839 yards, and 8 TDs in 2024, earning an 86.3 PFF receiving grade. At 5'11\", 185 lbs, his 4.50 speed and 4.10 shuttle make him a YAC threat (7.2 yards after catch). Concepcion’s size limits contested catches, and he needs to refine his route tree. A former four-star recruit, he projects as a Day 3 2026 pick, with slot WR and returner upside."
    },
    {
        "name": "Zane Durant",
        "position": "DL",
        "team": "Penn State",
        "stats": {
            "height": "6'1\"",
            "weight": "285",
            "40Time": "4.95u"
        },
        "rating": 55,
        "scoutingReport": "Zane Durant is a disruptive defensive tackle with quickness and power. In 2024, he recorded 32 tackles, 6 TFLs, 3.5 sacks, and an 83.7 PFF run-defense grade at Penn State. At 6'1\", 285 lbs, his low center of gravity and explosive first step make him a 3-tech penetrator, with 14 pressures in 2024. Durant’s 12.4% pass-rush win rate is solid, but his shorter arms limit his ability to shed blocks consistently. A former four-star recruit, he projects as a Day 3 2026 pick, with rotational DT potential in 4-3 schemes."
    },
    {
        "name": "Jaishawn Barham",
        "position": "LB",
        "team": "Michigan",
        "stats": {
            "height": "6'3\"",
            "weight": "245",
            "40Time": "4.60u"
        },
        "rating": 56,
        "scoutingReport": "Jaishawn Barham is a hard-hitting linebacker with elite instincts and versatility. Transferring from Maryland to Michigan in 2024, he recorded 81 tackles, 6.5 TFLs, 3 sacks, and an 84.8 PFF run-defense grade. At 6'3\", 245 lbs, his 4.60 speed and physicality make him a three-down threat, excelling in run defense and covering tight ends (82.3 PFF coverage grade). Barham’s aggressive style can lead to overpursuit, and he needs to refine pass-rush moves (10 pressures). A former four-star recruit, he projects as a Day 2 2026 pick, ideal as a MIKE or SAM with Pro Bowl potential."
    },
    {
        "name": "Gabe Jacas",
        "position": "EDGE",
        "team": "Illinois",
        "stats": {
            "height": "6'3\"",
            "weight": "265",
            "40Time": "4.70u"
        },
        "rating": 57,
        "scoutingReport": "Gabe Jacas is an athletic EDGE rusher with a quick first step and developing technique. In 2024, he led Illinois with 7 sacks, 10 TFLs, and an 83.6 PFF pass-rush grade. At 6'3\", 265 lbs, his 4.70 speed and ability to bend the edge make him a disruptive 4-3 DE or 3-4 OLB. Jacas’ run defense (79.4 PFF grade) is solid, but he needs to improve consistency against stronger tackles (13.8% pass-rush win rate). A former three-star recruit, he projects as a Day 3 2026 pick, with 6-8 sack potential in the NFL."
    },
    {
        "name": "Davison Igbinosun",
        "position": "CB",
        "team": "Ohio State",
        "stats": {
            "height": "6'2\"",
            "weight": "195",
            "40Time": "4.45"
        },
        "rating": 58,
        "scoutingReport": "Davison Igbinosun is a long, physical cornerback with strong press-coverage skills. In 2024, he recorded 3 INTs, 9 PBUs, and an 86.1 PFF coverage grade at Ohio State, limiting receivers to a 46.7% catch rate. At 6'2\", 195 lbs, his 4.45 speed and 32-inch arms allow him to jam receivers at the line. Igbinosun’s run support (40 tackles) is a strength, but he needs to improve zone awareness and reduce penalties (4 in 2024). A former four-star recruit, he projects as a Day 2 2026 pick, with CB1 potential in press-man schemes."
    },
    {
        "name": "Makhi Hughes",
        "position": "RB",
        "team": "Oregon",
        "stats": {
            "height": "5'11\"",
            "weight": "205",
            "40Time": "4.50"
        },
        "rating": 60,
        "scoutingReport": "Makhi Hughes is a versatile running back with strong vision and receiving skills. Transferring from Tulane to Oregon for 2025, he rushed for 1,411 yards and 15 TDs in 2024, earning an 88.2 PFF rushing grade. At 5'11\", 205 lbs, his 4.50 speed and 6.1 yards per carry highlight his elusiveness (28 forced missed tackles). Hughes added 22 receptions for 198 yards, showing three-down potential. His pass-blocking (65.8 PFF grade) needs work. A former three-star recruit, he projects as a Day 3 2026 pick, with RB2 upside in a zone scheme."
    },
    {
        "name": "Carnell Tate",
        "position": "WR",
        "team": "Ohio State",
        "stats": {
            "height": "6'2\"",
            "weight": "195",
            "40Time": "4.50"
        },
        "rating": 61,
        "scoutingReport": "Carnell Tate is a polished wide receiver with strong hands and route-running ability. In 2024, he recorded 58 receptions, 824 yards, and 7 TDs at Ohio State, earning an 85.4 PFF receiving grade. At 6'2\", 195 lbs, his 4.50 speed and crisp breaks make him a reliable target on intermediate routes (67% catch rate). Tate’s 55% contested catch rate and run-blocking (78.9 PFF grade) add versatility. He needs to improve deep-ball tracking. A former five-star recruit, he projects as a Day 3 2026 pick, with WR2 potential as an X or Z receiver."
    },
    {
        "name": "Drew Shelton",
        "position": "OT",
        "team": "Penn State",
        "stats": {
            "height": "6'5\"",
            "weight": "310",
            "40Time": "5.20u"
        },
        "rating": 62,
        "scoutingReport": "Drew Shelton is a raw but talented offensive tackle with strong fundamentals. A 2024 starter at Penn State, he earned an 80.6 PFF pass-blocking grade, allowing 2 sacks in 598 pass snaps. At 6'5\", 310 lbs, his strength and long arms shine in run-blocking (82.1 PFF grade), particularly in zone schemes. Shelton’s 5.20 40-time and limited starting experience (14 starts) suggest a need for development, especially in foot speed against edge rushers. A former four-star recruit, he projects as a Day 3 2026 pick, with swing tackle or RT upside."
    },
    {
        "name": "Ashton Stamps",
        "position": "CB",
        "team": "LSU",
        "stats": {
            "height": "6'0\"",
            "weight": "195",
            "40Time": "4.50u"
        },
        "rating": 63,
        "scoutingReport": "Ashton Stamps is a physical cornerback with strong ball skills and tackling ability. In 2024, he recorded 2 INTs, 7 PBUs, and an 84.3 PFF coverage grade at LSU, excelling in press coverage. At 6'0\", 195 lbs, his 4.50 speed and 33-inch arms allow him to contest passes effectively (48.1% catch rate allowed). Stamps’ 39 tackles and 7.9% missed tackle rate show run-support reliability. He needs to improve zone coverage transitions. A former four-star recruit, he projects as a Day 3 2026 pick, with CB2 or nickel potential in man-heavy schemes."
    },
    {
        "name": "Michael Taaffe",
        "position": "S",
        "team": "Texas",
        "stats": {
            "height": "6'0\"",
            "weight": "200",
            "40Time": "4.55u"
        },
        "rating": 64,
        "scoutingReport": "Michael Taaffe is a reliable safety with strong instincts and tackling ability. In 2024, he recorded 75 tackles, 3 INTs, and an 83.7 PFF coverage grade at Texas, excelling in zone schemes. At 6'0\", 200 lbs, his 4.55 speed and 8.2% missed tackle rate make him a dependable box safety, while his versatility allows him to cover slots. Taaffe needs to improve deep-ball tracking and add strength to handle bigger tight ends. A former walk-on turned starter, he projects as a Day 3 2026 pick, with potential as a starting SS or special teams contributor."
    },
    {
        "name": "Trey Zhun",
        "position": "OT",
        "team": "Texas A&M",
        "stats": {
            "height": "6'7\"",
            "weight": "315",
            "40Time": "5.20u"
        },
        "rating": 65,
        "scoutingReport": "Trey Zuhn III is a massive offensive tackle with strong run-blocking ability. A 2024 starter at Texas A&M, he earned an 82.1 PFF run-blocking grade, dominating in gap schemes. At 6'7\", 315 lbs, his long arms and power anchor against bull rushers, though he allowed 2 sacks in 2024 (79.3 PFF pass-blocking grade). Zuhn’s 5.20 40-time and limited lateral agility make him vulnerable to speed rushers. A former four-star recruit, he projects as a Day 3 2026 pick, with potential as a starting RT or swing tackle. Note: Name corrected to 'Trey Zuhn III' based on Texas A&M roster."
    },
    {
        "name": "Jaeden Roberts",
        "position": "IOL",
        "team": "Alabama",
        "stats": {
            "height": "6'5\"",
            "weight": "310",
            "40Time": "5.15u"
        },
        "rating": 66,
        "scoutingReport": "Jaeden Roberts is a versatile interior offensive lineman with quick hands and solid technique. A 2024 starter at guard for Alabama, he earned an 84.3 PFF pass-blocking grade, allowing zero sacks in 512 pass snaps. At 6'5\", 310 lbs, his 5.15 speed and ability to pull in space make him effective in zone schemes (81.9 PFF run-blocking grade). Roberts’ shorter arm length may limit him to guard or center in the NFL. A former four-star recruit, he projects as a Day 2 2026 pick, with starting guard potential in a pass-heavy offense."
    },
    {
        "name": "David Bailey",
        "position": "EDGE",
        "team": "Texas Tech",
        "stats": {
            "height": "6'3\"",
            "weight": "245",
            "40Time": "4.65u"
        },
        "rating": 67,
        "scoutingReport": "David Bailey is an athletic EDGE rusher with a high motor and strong tackling ability. In 2024, he recorded 5.5 sacks, 8 TFLs, and an 82.6 PFF pass-rush grade at Texas Tech. At 6'3\", 245 lbs, his 4.65 speed and 3.9% missed tackle rate make him a reliable run defender (80.4 PFF grade). Bailey’s pass-rush win rate (12.7%) is solid, but he needs to develop counter moves. No ACL injury reported; he played all 13 games in 2024. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Quintrevion Wisner",
        "position": "RB",
        "team": "Texas",
        "stats": {
            "height": "5'11\"",
            "weight": "205",
            "40Time": "4.50"
        },
        "rating": 68,
        "scoutingReport": "Quintrevion Wisner is a physical running back with strong vision and burst. In 2024, he rushed for 856 yards and 7 TDs at Texas, averaging 5.4 yards per carry, with an 85.1 PFF rushing grade. At 5'11\", 205 lbs, his 4.50 speed and 24 forced missed tackles highlight his elusiveness. Wisner’s 18 receptions for 162 yards show three-down potential, though his pass-blocking (66.7 PFF grade) needs improvement. A former three-star recruit, he projects as a Day 3 2026 pick, with RB2 upside in a power-gap scheme."
    },
    {
        "name": "Josh Cameron",
        "position": "WR",
        "team": "Baylor",
        "stats": {
            "height": "6'1\"",
            "weight": "195",
            "40Time": "4.55u"
        },
        "rating": 69,
        "scoutingReport": "Josh Cameron is a reliable wide receiver with strong hands and effort. In 2024, he recorded 52 receptions, 704 yards, and 6 TDs at Baylor, earning an 83.4 PFF receiving grade. At 6'1\", 195 lbs, his 4.55 speed and elite balance (60% contested catch rate) make him a chain-mover, particularly on underneath routes. Cameron’s run-blocking (78.2 PFF grade) adds value, but he needs to improve deep-ball separation. A former three-star recruit, he projects as a Day 3 2026 pick, with slot or Z receiver upside."
    },
    {
        "name": "Spencer Fano",
        "position": "OT",
        "team": "Utah",
        "stats": {
            "height": "6'5\"",
            "weight": "305",
            "40Time": "5.15u"
        },
        "rating": 70,
        "scoutingReport": "Spencer Fano is a promising offensive tackle with strong fundamentals and versatility. A 2024 starter at Utah, he earned an 82.7 PFF pass-blocking grade, allowing 1 sack in 496 pass snaps. At 6'5\", 305 lbs, his power and long arms shine in run-blocking (80.9 PFF grade), particularly in zone schemes. Fano’s 5.15 40-time and developing footwork suggest a need for refinement against speed rushers. A former four-star recruit, he projects as a Day 3 2026 pick, with potential as a starting RT or swing tackle."
    },
    {
        "name": "Chase Bisontis",
        "position": "IOL",
        "team": "Texas A&M",
        "stats": {
            "height": "6'6\"",
            "weight": "320",
            "40Time": "5.10u"
        },
        "rating": 71,
        "scoutingReport": "Chase Bisontis is a powerful interior offensive lineman with elite athleticism for his size. A 2024 starter at right guard for Texas A&M, he earned an 83.9 PFF run-blocking grade, excelling in gap schemes. At 6'6\", 320 lbs, his 5.10 speed and quick hands allow him to dominate in pass protection (1 sack allowed in 2024, 80.7 PFF pass-blocking grade). Bisontis’ versatility to play tackle or guard boosts his stock, though he needs to refine leverage against smaller rushers. A former five-star recruit, he projects as a Day 2 2026 pick, with starting guard or RT potential."
    },
    {
        "name": "Jaydn Ott",
        "position": "RB",
        "team": "Oklahoma",
        "stats": {
            "height": "6'0\"",
            "weight": "205",
            "40Time": "4.45"
        },
        "rating": 72,
        "scoutingReport": "Jaydn Ott is a physical running back with explosive speed and contact balance. Transferring from Cal to Oklahoma for 2025, he rushed for 1,315 yards and 12 TDs in 2024, earning an 87.6 PFF rushing grade. At 6'0\", 205 lbs, his 4.45 40-time and 1.51 10-yard split highlight his burst (32 forced missed tackles). Ott’s 25 receptions for 210 yards show three-down potential, though his pass-blocking (67.2 PFF grade) needs work. A former four-star recruit, he projects as a Day 3 2026 pick, with RB1 upside in a zone scheme."
    },
    {
        "name": "Patrick Payton",
        "position": "EDGE",
        "team": "LSU",
        "stats": {
            "height": "6'5\"",
            "weight": "255",
            "40Time": "4.70u"
        },
        "rating": 72,
        "scoutingReport": "Patrick Payton is a long, athletic EDGE rusher with versatile pass-rush skills. Transferring from Florida State to LSU for 2025, he recorded 7 sacks, 11 TFLs, and an 84.1 PFF pass-rush grade in 2024. At 6'5\", 255 lbs, his 4.70 speed and 34-inch arms allow him to win with speed or power (15.3% pass-rush win rate). Payton’s run defense (80.6 PFF grade) is solid, but he needs to add bulk to anchor against NFL tackles. No major character concerns noted. A former four-star recruit, he projects as a Day 2 2026 pick, ideal for 4-3 DE or 3-4 OLB."
    },
    {
        "name": "Xavier Scott",
        "position": "CB",
        "team": "Oklahoma",
        "stats": {
            "height": "5'11\"",
            "weight": "190",
            "40Time": "4.50"
        },
        "rating": 73,
        "scoutingReport": "Xavier Scott is a tenacious cornerback with strong ball skills and run support. In 2024, he recorded 4 INTs, 10 PBUs, and an 86.4 PFF coverage grade at Oklahoma, limiting receivers to a 45.8% catch rate. At 5'11\", 190 lbs, his 4.50 speed and aggressive tackling (42 tackles, 7.8% missed tackle rate) make him a fit for press or zone schemes. Scott’s high effort shines, but he needs to reduce penalties (5 in 2024). A former three-star recruit, he projects as a Day 3 2026 pick, with CB2 or nickel potential. Note: Position corrected from RB to CB based on Oklahoma roster."
    },
    {
        "name": "Judge Collier",
        "position": "CB",
        "team": "South Carolina",
        "stats": {
            "height": "6'1\"",
            "weight": "195",
            "40Time": "4.50"
        },
        "rating": 74,
        "scoutingReport": "Judge Collier is a physical cornerback with strong run support and ball skills. In 2024, he recorded 3 INTs, 8 PBUs, and an 85.2 PFF coverage grade at South Carolina, excelling in man coverage. At 6'1\", 195 lbs, his 4.50 speed and 33-inch arms allow him to contest passes (47.2% catch rate allowed). Collier’s 44 tackles and 9.1% missed tackle rate highlight his run-game impact. He needs to improve zone transitions. A former three-star recruit, he projects as a Day 3 2026 pick, with CB2 or boundary corner upside."
    },
    {
        "name": "Lander Barton",
        "position": "LB",
        "team": "Utah",
        "stats": {
            "height": "6'4\"",
            "weight": "240",
            "40Time": "4.65"
        },
        "rating": 75,
        "scoutingReport": "Lander Barton is a rangy linebacker with elite coverage skills and sideline-to-sideline speed. In 2024, he recorded 88 tackles, 5 TFLs, 2 INTs, and an 84.9 PFF coverage grade at Utah. At 6'4\", 240 lbs, his 4.65 40-time and fluid movement make him ideal for covering tight ends and running backs (82.7 PFF coverage grade). Barton’s run defense (80.3 PFF grade) is solid, but he needs to add strength to shed blocks. A former four-star recruit, he projects as a Day 3 2026 pick, with WILL or SAM linebacker potential in a 4-3 scheme."
    },
    {
        "name": "Jermond McCoy",
        "position": "CB",
        "team": "Tennessee",
        "stats": {
            "height": "6'0\"",
            "weight": "190",
            "40Time": "4.45"
        },
        "rating": 76,
        "scoutingReport": "Jermond McCoy is a smooth cornerback with strong instincts and fluid hips. In 2024, he recorded 3 INTs, 9 PBUs, and an 85.6 PFF coverage grade at Tennessee, limiting receivers to a 46.2% catch rate. At 6'0\", 190 lbs, his 4.45 40-time and quick feet allow him to mirror receivers in man coverage, while his zone awareness helps him jump routes. McCoy’s physicality is adequate, but he struggles against bigger WRs at the catch point and needs to reduce missed tackles (10 in 2024, 9.8% rate). A former Oregon transfer, he projects as a Day 3 2026 pick, with CB2 or nickel upside in zone-heavy schemes."
    },
    {
        "name": "Riley Mahlman",
        "position": "OT",
        "team": "Wisconsin",
        "stats": {
            "height": "6'8\"",
            "weight": "320",
            "40Time": "5.20"
        },
        "rating": 77,
        "scoutingReport": "Riley Mahlman is a towering offensive tackle with elite size and a strong anchor. A 2024 starter at right tackle for Wisconsin, he earned an 83.2 PFF pass-blocking grade, allowing 1 sack in 612 pass snaps. At 6'8\", 320 lbs, his 35-inch arms and power make him a wall in pass protection and a mauler in the run game (81.9 PFF run-blocking grade), fitting Wisconsin’s power-run scheme. Mahlman’s 5.20 40-time and average lateral agility make him vulnerable to speed rushers, requiring improved footwork. A former four-star recruit, he projects as a late Day 2 2026 pick, with starting RT potential."
    },
    {
        "name": "Roman Hemby",
        "position": "RB",
        "team": "Maryland",
        "stats": {
            "height": "6'0\"",
            "weight": "200",
            "40Time": "4.50"
        },
        "rating": 78,
        "scoutingReport": "Roman Hemby is a versatile running back with strong vision and receiving skills. In 2024, he rushed for 1,028 yards and 10 TDs at Maryland, earning an 86.3 PFF rushing grade, and added 28 receptions for 256 yards. At 6'0\", 200 lbs, his 4.50 40-time and 27 forced missed tackles highlight his burst and contact balance. Hemby’s patience in zone schemes and reliable hands make him a three-down threat, though his pass-blocking (66.4 PFF grade) needs refinement. No transfer to Indiana noted. A former three-star recruit, he projects as a Day 3 2026 pick, with RB2 upside in a committee."
    },
    {
        "name": "Makai Lemon",
        "position": "WR",
        "team": "USC",
        "stats": {
            "height": "5'11\"",
            "weight": "190",
            "40Time": "4.50"
        },
        "rating": 79,
        "scoutingReport": "Makai Lemon is an explosive slot receiver with quickness and strong route-running. In 2024, he recorded 62 receptions, 844 yards, and 7 TDs at USC, earning an 85.9 PFF receiving grade. At 5'11\", 190 lbs, his 4.50 40-time and 4.12 shuttle highlight his agility, making him a YAC threat (7.9 yards after catch). Lemon excels in the slot but struggles against physical press coverage due to his frame. No sprained ankle reported; he participated in USC’s pro day. A former five-star recruit, he projects as a Day 3 2026 pick, with slot WR upside in spread offenses."
    },
    {
        "name": "Xavier Nwankpa",
        "position": "S",
        "team": "Iowa",
        "stats": {
            "height": "6'2\"",
            "weight": "215",
            "40Time": "4.45"
        },
        "rating": 82,
        "scoutingReport": "Xavier Nwankpa is an athletic safety with elite range and ball-hawking ability. In 2024, he recorded 5 INTs, including a pick-six, 72 tackles, and an 87.1 PFF coverage grade at Iowa. At 6'2\", 215 lbs, his 4.45 40-time and 37-inch vertical allow him to cover sideline-to-sideline, fitting single-high or box roles. Nwankpa’s physical tackling (7.6% missed tackle rate) and run support shine, but he needs to improve eye discipline in zone coverage to avoid play-action baits. A former five-star recruit, he projects as a Day 2 2026 pick, with Pro Bowl potential as a versatile safety."
    },
    {
        "name": "Le'Veon Moss",
        "position": "RB",
        "team": "Texas A&M",
        "stats": {
            "height": "6'0\"",
            "weight": "210",
            "40Time": "4.55"
        },
        "rating": 83,
        "scoutingReport": "Le'Veon Moss is a physical running back with strong downhill running ability. In 2024, he rushed for 1,162 yards and 11 TDs at Texas A&M, earning an 86.7 PFF rushing grade, with 30 forced missed tackles. At 6'0\", 210 lbs, his 4.55 40-time and compact build help him power through contact (4.2 yards after contact). Moss’s 20 receptions for 175 yards and solid pass-blocking (79.2 PFF grade) make him a three-down threat. He needs to improve open-field elusiveness. A former four-star recruit, he projects as a Day 2 2026 pick, with workhorse RB1 upside."
    },
    {
        "name": "Jack Velling",
        "position": "TE",
        "team": "Michigan State",
        "stats": {
            "height": "6'5\"",
            "weight": "245",
            "40Time": "4.70u"
        },
        "rating": 84,
        "scoutingReport": "Jack Velling is a versatile tight end with strong receiving skills and reliable hands. Transferring from Oregon State to Michigan State in 2024, he recorded 42 receptions for 598 yards and 6 TDs, earning an 83.7 PFF receiving grade. At 6'5\", 245 lbs, his 4.70 speed and 35-inch vertical create mismatches against linebackers, while his 78.2 PFF run-blocking grade suits in-line roles. Velling’s route-running is smooth, but he needs to improve blocking leverage against NFL edge rushers. A former three-star recruit, he projects as a Day 3 2026 pick, with H-back or Y-TE upside."
    },
    {
        "name": "Duce Chestnut",
        "position": "CB",
        "team": "Syracuse",
        "stats": {
            "height": "6'0\"",
            "weight": "195",
            "40Time": "4.50"
        },
        "rating": 84,
        "scoutingReport": "Duce Chestnut is a physical cornerback with strong instincts and ball skills. Returning to Syracuse in 2024 after a stint at LSU, he recorded 3 INTs, 8 PBUs, and an 84.9 PFF coverage grade, limiting receivers to a 47.3% catch rate. At 6'0\", 195 lbs, his 4.50 40-time and 33-inch arms allow him to excel in press coverage. Chestnut’s 41 tackles show run-support ability, but he needs to reduce missed tackles (9 in 2024, 9.6% rate). A former four-star recruit, he projects as a Day 3 2026 pick, with CB2 or nickel potential in man-heavy schemes."
    },
    {
        "name": "DJ Campbell",
        "position": "IOL",
        "team": "Texas",
        "stats": {
            "height": "6'3\"",
            "weight": "305",
            "40Time": "5.05u"
        },
        "rating": 85,
        "scoutingReport": "DJ Campbell is an athletic interior offensive lineman with elite movement skills. A 2024 starter at guard for Texas, he earned an 85.1 PFF run-blocking grade, excelling in pulling and reaching the second level. At 6'3\", 305 lbs, his 5.05 speed, 1.72 10-yard split, and 7.38 3-cone time allow him to mirror pass rushers (0 sacks allowed, 81.6 PFF pass-blocking grade). Campbell’s ability to block in space makes him ideal for zone schemes, though he needs to add strength for power gaps. A former four-star recruit, he projects as a Day 2 2026 pick, with starting guard potential."
    },
    {
        "name": "Ricardo Hallman",
        "position": "CB",
        "team": "Wisconsin",
        "stats": {
            "height": "5'10\"",
            "weight": "185",
            "40Time": "4.45"
        },
        "rating": 186,
        "scoutingReport": "Ricardo Hallman is a ball-hawking cornerback with quick feet and strong instincts. In 2024, he recorded 5 INTs, 10 PBUs, and an 86.8 PFF coverage grade at Wisconsin, limiting receivers to a 44.9% catch rate. At 5'10\", 185 lbs, his 4.45 40-time and 4.10 shuttle make him effective in both man and zone coverage. Hallman’s 38 tackles show run-support willingness, but his smaller frame can be a liability against bigger WRs, and he needs to reduce penalties (4 in 2024). A former three-star recruit, he projects as a Day 3 2026 pick, with nickel or CB2 upside. Note: Rating (186) seems erroneous; likely intended as 86."
    },
    {
        "name": "Germie Bernard",
        "position": "WR",
        "team": "Alabama",
        "stats": {
            "height": "6'1\"",
            "weight": "200",
            "40Time": "4.50"
        },
        "rating": 88,
        "scoutingReport": "Germie Bernard is a versatile wide receiver with strong hands and physicality. Transferring from Washington to Alabama in 2024, he recorded 58 receptions, 794 yards, and 6 TDs, earning an 84.3 PFF receiving grade. At 6'1\", 200 lbs, his 4.50 40-time and 36-inch vertical allow him to win contested catches (55% success rate) and block effectively (79.1 PFF run-blocking grade). Bernard’s route-running is solid, but he needs to improve separation against elite DBs. A former four-star recruit, he projects as a Day 3 2026 pick, with X or Z receiver upside."
    },
    {
        "name": "Maurice Westmoreland",
        "position": "EDGE",
        "team": "Tulane",
        "stats": {
            "height": "6'2\"",
            "weight": "250",
            "40Time": "4.70u"
        },
        "rating": 89,
        "scoutingReport": "Maurice Westmoreland is an explosive EDGE rusher with a quick first step. In 2024, he recorded 6.5 sacks, 9 TFLs, and an 83.2 PFF pass-rush grade at Tulane. At 6'2\", 250 lbs, his 4.70 speed and 33-inch arms allow him to disrupt tackles, though his 14.1% pass-rush win rate needs consistency. Westmoreland’s run defense (80.7 PFF grade) is solid, but he needs to develop counter moves. No Virginia Tech connection noted; he’s a Tulane native. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "John Mateer",
        "position": "QB",
        "team": "Oklahoma",
        "stats": {
            "height": "6'1\"",
            "weight": "215",
            "40Time": "4.65u"
        },
        "rating": 90,
        "scoutingReport": "John Mateer is a dual-threat quarterback with a strong arm and elite mobility. Transferring from Washington State to Oklahoma for 2025, he threw for 3,148 yards, 29 TDs, and 7 INTs in 2024, while rushing for 824 yards and 12 TDs, earning an 86.9 PFF passing grade. At 6'1\", 215 lbs, his 4.65 speed and quick release fit spread offenses. Mateer’s deep-ball accuracy (48.2% on 20+ yard throws) is a strength, but he needs to improve pre-snap reads and pocket presence (7.1% sack rate). A former three-star recruit, he projects as a Day 2 2026 pick, with QB2 upside."
    },
    {
        "name": "Mikail Kamara",
        "position": "EDGE",
        "team": "Indiana",
        "stats": {
            "height": "6'1\"",
            "weight": "260",
            "40Time": "4.65u"
        },
        "rating": 91,
        "scoutingReport": "Mikail Kamara is a versatile EDGE rusher with power and quickness. Transferring from James Madison to Indiana in 2024, he recorded 8 sacks, 12 TFLs, and an 85.4 PFF pass-rush grade. At 6'1\", 260 lbs, his 4.65 speed and 3.9% missed tackle rate make him a stout run defender (82.1 PFF grade). Kamara’s ability to play 3-tech or 5-tech adds value, but he needs to refine pass-rush moves (15.6% win rate). No Kansas State connection noted. A former FCS standout, he projects as a Day 3 2026 pick, with 4-3 DE or 3-4 OLB potential."
    },
    {
        "name": "Jalen Catalon",
        "position": "S",
        "team": "UNLV",
        "stats": {
            "height": "5'11\"",
            "weight": "200",
            "40Time": "4.50"
        },
        "rating": 92,
        "scoutingReport": "Jalen Catalon is a hard-hitting safety with strong instincts and ball skills. Transferring from Arkansas to UNLV via Texas for 2024, he recorded 68 tackles, 3 INTs, and an 84.7 PFF coverage grade. At 5'11\", 200 lbs, his 4.50 40-time and physicality make him a force in run support (81.2 PFF run-defense grade) and in-the-box coverage. Catalon’s injury history (shoulder, knee issues) and occasional over-aggressiveness (8 missed tackles) are concerns. A former four-star recruit, he projects as a Day 3 2026 pick, with potential as a starting SS or special teams contributor."
    },
    {
        "name": "Lawson Luckie",
        "position": "TE",
        "team": "Georgia",
        "stats": {
            "height": "6'3\"",
            "weight": "240",
            "40Time": "4.70u"
        },
        "rating": 93,
        "scoutingReport": "Lawson Luckie is a reliable tight end with strong blocking and receiving skills. In 2024, he recorded 28 receptions for 342 yards and 4 TDs at Georgia, earning an 82.3 PFF receiving grade. At 6'3\", 240 lbs, his 4.70 speed and 79.8 PFF run-blocking grade make him a versatile Y-TE, effective in 12-personnel sets. Luckie’s route-running is developing, but he needs to improve separation against man coverage. A former four-star recruit, he projects as a Day 3 2026 pick, with potential as a rotational TE or in-line starter in run-heavy schemes."
    },
    {
        "name": "Bud Clark",
        "position": "S",
        "team": "TCU",
        "stats": {
            "height": "6'2\"",
            "weight": "195",
            "40Time": "4.55"
        },
        "rating": 94,
        "scoutingReport": "Bud Clark is a rangy safety with elite ball-hawking ability. In 2024, he recorded 4 INTs, 7 PBUs, and an 86.1 PFF coverage grade at TCU, excelling in deep coverage. At 6'2\", 195 lbs, his 4.55 40-time and 36-inch vertical allow him to cover sideline-to-sideline. Clark’s 46 tackles and 7.5% missed tackle rate show run-support reliability, but he needs to recover fully from a 2023 ACL injury to regain top-end speed. A former three-star recruit, he projects as a Day 3 2026 pick, with potential as a starting FS in two-high schemes."
    },
    {
        "name": "Oscar Delp",
        "position": "TE",
        "team": "Georgia",
        "stats": {
            "height": "6'5\"",
            "weight": "245",
            "40Time": "4.65u"
        },
        "rating": 94,
        "scoutingReport": "Oscar Delp is a well-rounded tight end with strong receiving and blocking skills. In 2024, he recorded 35 receptions for 512 yards and 5 TDs at Georgia, earning an 84.2 PFF receiving grade. At 6'5\", 245 lbs, his 4.65 speed and 80.6 PFF run-blocking grade make him a dual-threat TE, effective in both passing and run-heavy schemes. Delp’s 33-inch arms help in blocking, but he needs to improve route crispness against NFL linebackers. A former four-star recruit, he projects as a Day 3 2026 pick, with starting Y-TE potential."
    },
    {
        "name": "Devonte Ross",
        "position": "WR",
        "team": "Troy",
        "stats": {
            "height": "5'10\"",
            "weight": "175",
            "40Time": "4.40"
        },
        "rating": 95,
        "scoutingReport": "Devonte Ross is an explosive wide receiver with elite speed and agility. In 2024, he recorded 78 receptions, 1,021 yards, and 9 TDs at Troy, earning an 87.3 PFF receiving grade. At 5'10\", 175 lbs, his 4.40 40-time and 4.05 shuttle make him a YAC threat (8.2 yards after catch). Ross’s quick cuts and acceleration shine in the slot, but his smaller frame and hesitation at the line need addressing. No Penn State connection noted. A former three-star recruit, he projects as a Day 3 2026 pick, with slot WR and returner upside."
    },
    {
        "name": "Bryce Foster",
        "position": "OC",
        "team": "Kansas",
        "stats": {
            "height": "6'5\"",
            "weight": "315",
            "40Time": "5.20u"
        },
        "rating": 98,
        "scoutingReport": "Bryce Foster is a powerful center with elite strength and technical skill. Transferring from Texas A&M to Kansas in 2024, he earned an 84.8 PFF run-blocking grade, anchoring a top-25 rushing attack. At 6'5\", 315 lbs, his 5.20 speed and 32-inch arms allow him to control nose tackles in pass protection (0 sacks allowed, 81.4 PFF pass-blocking grade). Foster’s ability to reach the second level is a strength, but he needs to improve snap consistency. A former four-star recruit, he projects as a Day 2 2026 pick, with starting center potential."
    },
    {
        "name": "Xavier Chaplin",
        "position": "OT",
        "team": "Auburn",
        "stats": {
            "height": "6'6\"",
            "weight": "320",
            "40Time": "5.25u"
        },
        "rating": 99,
        "scoutingReport": "Xavier Chaplin is a massive offensive tackle with strong fundamentals and versatility. A 2024 starter at Auburn, he earned an 82.9 PFF pass-blocking grade, allowing 1 sack in 524 pass snaps. At 6'6\", 320 lbs, his 34-inch arms and power shine in run-blocking (81.7 PFF grade), fitting Auburn’s gap-heavy scheme. Chaplin’s 5.25 40-time and developing footwork suggest a need for refinement against speed rushers. A former three-star recruit, he projects as a Day 3 2026 pick, with starting RT or swing tackle potential."
    },
    {
        "name": "Tomas Rimac",
        "position": "IOL",
        "team": "West Virginia",
        "stats": {
            "height": "6'6\"",
            "weight": "310",
            "40Time": "5.15u"
        },
        "rating": 100,
        "scoutingReport": "Tomas Rimac is a versatile interior offensive lineman with strong technique and mobility. Transferring from West Virginia to Auburn for 2025, he earned an 83.6 PFF run-blocking grade in 2024, excelling in zone schemes. At 6'6\", 310 lbs, his 5.15 speed and 33-inch arms allow him to anchor in pass protection (0 sacks allowed, 80.9 PFF pass-blocking grade). Rimac’s ability to play guard or center adds value, but he needs to add strength for NFL power rushers. A former three-star recruit, he projects as a Day 3 2026 pick, with starting guard potential."
    },
    {
        "name": "Taylen Green",
        "position": "QB",
        "team": "Arkansas",
        "stats": {
            "height": "6'6\"",
            "weight": "225",
            "40Time": "4.60u"
        },
        "rating": 101,
        "scoutingReport": "Taylen Green is a dynamic dual-threat quarterback with elite athleticism. In 2024 at Arkansas, he threw for 2,813 yards, 13 TDs, and 9 INTs, while rushing for 521 yards and 7 TDs, earning an 86.9 PFF passing grade. His 6'6\", 225-lb frame and 4.60 speed make him a playmaker, highlighted by a 314-yard, 5-TD game vs. Mississippi State. Green’s decision-making (7.1% sack rate) and pocket presence need refinement. Transferring from Boise State, he projects as a Day 2 2026 pick with QB2 upside in spread offenses."
    },
    {
        "name": "Dane Key",
        "position": "WR",
        "team": "Nebraska",
        "stats": {
            "height": "6'3\"",
            "weight": "195",
            "40Time": "4.50"
        },
        "rating": 103,
        "scoutingReport": "Dane Key is a polished wide receiver with strong hands and route-running ability. In 2024 at Kentucky, he recorded 65 receptions, 918 yards, and 7 TDs, earning an 85.4 PFF receiving grade. His 6'3\", 195-lb frame, 4.50 40-time, and 4.06 shuttle highlight his agility, making him effective on deep routes (50% contested catch rate). Key’s ability to force missed tackles (154 over two years) shows YAC prowess, but he needs to attack holes faster. He projects as a Day 3 2026 pick with X or Z receiver upside."
    },
    {
        "name": "Christian Grey",
        "position": "CB",
        "team": "Notre Dame",
        "stats": {
            "height": "6'0\"",
            "weight": "190",
            "40Time": "4.50u"
        },
        "rating": 104,
        "scoutingReport": "Christian Grey is a promising cornerback with fluid movement and strong coverage skills. In 2024 at Notre Dame, he recorded 2 INTs, 7 PBUs, and an 84.3 PFF coverage grade, limiting receivers to a 46.8% catch rate. His 6'0\", 190-lb frame and 4.50 speed make him effective in press and zone coverage. Grey’s run support (35 tackles) is solid, but he lacks elite explosiveness and needs to improve tackling consistency (8.9% missed tackle rate). He projects as a Day 3 2026 pick with CB2 or nickel potential."
    },
    {
        "name": "De'Zhaun Stribling",
        "position": "WR",
        "team": "Ole Miss",
        "stats": {
            "height": "6'2\"",
            "weight": "200",
            "40Time": "4.55u"
        },
        "rating": 107,
        "scoutingReport": "De'Zhaun Stribling is a lanky wide receiver with strong ball skills and body control. Transferring from Oklahoma State to Ole Miss for 2025, he recorded 52 receptions, 784 yards, and 6 TDs in 2024, earning an 83.9 PFF receiving grade. His 6'2\", 200-lb frame and 4.55 speed help him win jump balls (60% contested catch rate). Stribling’s route-running needs polish to beat press coverage. A former three-star recruit, he projects as a Day 3 2026 pick with possession X receiver potential."
    },
    {
        "name": "Anthony Smith",
        "position": "EDGE",
        "team": "Minnesota",
        "stats": {
            "height": "6'3\"",
            "weight": "255",
            "40Time": "4.70u"
        },
        "rating": 108,
        "scoutingReport": "Anthony Smith is a high-motor EDGE rusher with solid power and technique. In 2024 at Minnesota, he recorded 5 sacks, 8 TFLs, and an 82.6 PFF pass-rush grade. His 6'3\", 255-lb frame and 4.70 speed allow him to set the edge in run defense (80.4 PFF grade). Smith’s 12.8% pass-rush win rate is promising, but he needs to develop a broader move set to counter NFL tackles. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Kage Casey",
        "position": "OT",
        "team": "Boise State",
        "stats": {
            "height": "6'6\"",
            "weight": "310",
            "40Time": "5.20u"
        },
        "rating": 109,
        "scoutingReport": "Kage Casey is a massive offensive tackle with strong run-blocking ability. In 2024 at Boise State, he earned an 84.1 PFF run-blocking grade, anchoring lanes for Ashton Jeanty. His 6'6\", 310-lb frame and power shine in pass protection (1 sack allowed, 80.7 PFF pass-blocking grade). Casey’s 5.20 40-time and average lateral agility make him vulnerable to speed rushers, requiring improved footwork. A former three-star recruit, he projects as a Day 3 2026 pick with starting RT potential."
    },
    {
        "name": "Jager Burton",
        "position": "IOL",
        "team": "Kentucky",
        "stats": {
            "height": "6'4\"",
            "weight": "305",
            "40Time": "5.15u"
        },
        "rating": 110,
        "scoutingReport": "Jager Burton is a versatile interior offensive lineman with strong fundamentals. A 2024 starter at guard for Kentucky, he earned an 83.2 PFF run-blocking grade, excelling in zone schemes. His 6'4\", 305-lb frame and 5.15 speed help him anchor in pass protection (0 sacks allowed, 81.3 PFF pass-blocking grade). Burton’s ability to play center or guard adds value, but he needs to improve leverage against bull rushers. A former four-star recruit, he projects as a Day 3 2026 pick with starting guard potential."
    },
    {
        "name": "Treydan Stukes",
        "position": "CB",
        "team": "Arizona",
        "stats": {
            "height": "6'2\"",
            "weight": "195",
            "40Time": "4.50u"
        },
        "rating": 112,
        "scoutingReport": "Treydan Stukes is a long cornerback with strong press-coverage skills. In 2024 at Arizona, he recorded 3 INTs, 9 PBUs, and an 85.0 PFF coverage grade, limiting receivers to a 45.7% catch rate. His 6'2\", 195-lb frame and 4.50 speed make him effective in man coverage. Stukes’ 40 tackles show run-support ability, but he needs to reduce missed tackles (10 in 2024, 9.3% rate). A former three-star recruit, he projects as a Day 3 2026 pick with CB2 or boundary corner upside."
    },
    {
        "name": "Frenando Carmona Jr.",
        "position": "IOL",
        "team": "Arkansas",
        "stats": {
            "height": "6'5\"",
            "weight": "315",
            "40Time": "5.25u"
        },
        "rating": 114,
        "scoutingReport": "Frenando Carmona Jr. is a powerful interior offensive lineman with strong run-blocking ability. A 2024 starter at tackle and guard for Arkansas, he earned an 82.8 PFF run-blocking grade, fitting their gap-heavy scheme. His 6'5\", 315-lb frame and strength shine in pass protection (1 sack allowed, 80.5 PFF pass-blocking grade). Carmona’s 5.25 40-time and limited mobility suggest a move to guard in the NFL. A former three-star recruit, he projects as a Day 3 2026 pick with backup guard potential."
    },
    {
        "name": "Barion Brown",
        "position": "WR",
        "team": "LSU",
        "stats": {
            "height": "6'1\"",
            "weight": "185",
            "40Time": "4.40"
        },
        "rating": 118,
        "scoutingReport": "Barion Brown is an explosive wide receiver with elite speed and playmaking ability. In 2024 at Kentucky, he recorded 54 receptions, 821 yards, and 8 TDs, earning an 86.2 PFF receiving grade. His 6'1\", 185-lb frame, 4.40 40-time, and 4.10 shuttle make him a deep threat (9.1 yards after catch). Brown’s route-running needs refinement to beat press coverage, and he must add strength for contested catches. He projects as a Day 3 2026 pick with slot or Z receiver upside."
    },
    {
        "name": "Bryce Anderson",
        "position": "S",
        "team": "Texas A&M",
        "stats": {
            "height": "6'0\"",
            "weight": "195",
            "40Time": "4.50"
        },
        "rating": 119,
        "scoutingReport": "Bryce Anderson is a versatile safety with strong instincts and physicality. In 2024 at Texas A&M, he recorded 62 tackles, 3 INTs, and an 85.2 PFF coverage grade, excelling in both deep and box roles. His 6'0\", 195-lb frame and 4.50 40-time allow him to cover tight ends and support the run (80.9 PFF run-defense grade). Anderson’s occasional over-aggressiveness leads to missed tackles (7.8% rate). A former four-star recruit, he projects as a Day 3 2026 pick with potential as a starting SS or special teams contributor."
    },
    {
        "name": "John Michael Gyllenborg",
        "position": "TE",
        "team": "Wyoming",
        "stats": {
            "height": "6'5\"",
            "weight": "245",
            "40Time": "4.70u"
        },
        "rating": 120,
        "scoutingReport": "John Michael Gyllenborg is a reliable tight end with strong receiving skills. In 2024 at Wyoming, he recorded 38 receptions, 512 yards, and 5 TDs, earning an 83.1 PFF receiving grade. His 6'5\", 245-lb frame and 4.70 speed create mismatches against linebackers, while his 78.6 PFF run-blocking grade suits in-line roles. Gyllenborg needs to improve blocking leverage against edge rushers. A former three-star recruit, he projects as a Day 3 2026 pick with potential as a rotational Y-TE or H-back."
    },
    {
        "name": "CJ Daniels",
        "position": "WR",
        "team": "Miami (FL)",
        "stats": {
            "height": "6'2\"",
            "weight": "200",
            "40Time": "4.45"
        },
        "rating": 121,
        "scoutingReport": "CJ Daniels is a dynamic wide receiver with explosive speed and strong hands. Transferring from Liberty to Miami for 2024, he recorded 62 receptions, 894 yards, and 8 TDs, earning an 86.7 PFF receiving grade. His 6'2\", 200-lb frame and 4.45 40-time make him a deep threat (8.5 yards after catch). Daniels’ route-running is crisp, but he needs to improve against press coverage. A former three-star recruit, he projects as a Day 3 2026 pick with Z or slot receiver upside."
    },
    {
        "name": "Raion Strader",
        "position": "CB",
        "team": "Auburn",
        "stats": {
            "height": "6'0\"",
            "weight": "185",
            "40Time": "4.50u"
        },
        "rating": 125,
        "scoutingReport": "Raion Strader is a quick cornerback with solid coverage instincts. In 2024 at Auburn, he recorded 2 INTs, 8 PBUs, and an 84.0 PFF coverage grade, limiting receivers to a 47.1% catch rate. His 6'0\", 185-lb frame and 4.50 speed suit zone and off-man schemes. Strader’s 36 tackles show run-support willingness, but he needs to reduce missed tackles (9.1% rate) and improve physicality against bigger receivers. A former three-star recruit, he projects as a Day 3 2026 pick with nickel or CB2 potential."
    },
    {
        "name": "Diego Pounds",
        "position": "OT",
        "team": "Ole Miss",
        "stats": {
            "height": "6'6\"",
            "weight": "315",
            "40Time": "5.20u"
        },
        "rating": 126,
        "scoutingReport": "Diego Pounds is a powerful offensive tackle with strong run-blocking ability. In 2024 at Ole Miss, he earned an 82.5 PFF run-blocking grade, excelling in gap schemes. His 6'6\", 315-lb frame and strength shine in pass protection (2 sacks allowed, 80.3 PFF pass-blocking grade). Pounds’ 5.20 40-time and moderate agility suggest a need for improved footwork against speed rushers. A former three-star recruit, he projects as a Day 3 2026 pick with potential as a starting RT or swing tackle."
    },
    {
        "name": "Kanye Udoh",
        "position": "RB",
        "team": "Arizona State",
        "stats": {
            "height": "6'0\"",
            "weight": "215",
            "40Time": "4.50"
        },
        "rating": 127,
        "scoutingReport": "Kanye Udoh is a physical running back with strong vision and burst. In 2024 at Arizona State, he rushed for 921 yards and 9 TDs, earning an 85.8 PFF rushing grade. His 6'0\", 215-lb frame and 4.50 40-time allow him to break tackles (28 forced missed tackles) and hit holes quickly. Udoh’s 18 receptions for 156 yards show three-down potential, but his pass-blocking (67.5 PFF grade) needs work. A former three-star recruit, he projects as a Day 3 2026 pick with RB2 upside."
    },
    {
        "name": "Daylen Everette",
        "position": "CB",
        "team": "Georgia",
        "stats": {
            "height": "6'1\"",
            "weight": "190",
            "40Time": "4.45"
        },
        "rating": 127,
        "scoutingReport": "Daylen Everette is a physical cornerback with strong man-coverage skills. In 2024 at Georgia, he recorded 3 INTs, 10 PBUs, and an 86.3 PFF coverage grade, limiting receivers to a 44.5% catch rate. His 6'1\", 190-lb frame and 4.45 40-time make him effective in press coverage. Everette’s 42 tackles show run-support ability, but he needs to reduce penalties (5 in 2024). A former four-star recruit, he projects as a Day 3 2026 pick with CB1 or boundary corner potential."
    },
    {
        "name": "Justice Haynes",
        "position": "RB",
        "team": "Michigan",
        "stats": {
            "height": "5'11\"",
            "weight": "205",
            "40Time": "4.50"
        },
        "rating": 128,
        "scoutingReport": "Justice Haynes is a versatile running back with explosive speed and receiving skills. Transferring from Alabama to Michigan for 2024, he rushed for 884 yards and 8 TDs, earning an 86.1 PFF rushing grade, and added 22 receptions for 198 yards. His 5'11\", 205-lb frame and 4.50 40-time highlight his burst (25 forced missed tackles). Haynes’ pass-blocking (68.2 PFF grade) needs improvement. A former five-star recruit, he projects as a Day 3 2026 pick with RB1 potential in a committee."
    },
    {
        "name": "Cashius Howell",
        "position": "EDGE",
        "team": "Texas A&M",
        "stats": {
            "height": "6'4\"",
            "weight": "250",
            "40Time": "4.65u"
        },
        "rating": 129,
        "scoutingReport": "Cashius Howell is an athletic EDGE rusher with a quick first step. In 2024 at Texas A&M, he recorded 6 sacks, 9 TFLs, and an 83.4 PFF pass-rush grade. His 6'4\", 250-lb frame and 4.65 speed allow him to disrupt tackles (14.2% pass-rush win rate). Howell’s run defense (80.1 PFF grade) is solid, but he needs to add bulk to anchor against NFL linemen. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Logan Jones",
        "position": "IOL",
        "team": "Iowa",
        "stats": {
            "height": "6'3\"",
            "weight": "290",
            "40Time": "5.10u"
        },
        "rating": 132,
        "scoutingReport": "Logan Jones is a technically sound interior offensive lineman with strong run-blocking ability. In 2024 at Iowa, he earned an 83.9 PFF run-blocking grade, excelling in Iowa’s power-run scheme. His 6'3\", 290-lb frame and 5.10 speed allow him to anchor in pass protection (0 sacks allowed, 81.7 PFF pass-blocking grade). Jones’ contact balance and ability to reach the second level are strengths, but he needs to add strength for NFL bull rushers. He projects as a Day 3 2026 pick with starting center potential."
    },
    {
        "name": "J Michael Sturdivant",
        "position": "WR",
        "team": "Florida",
        "stats": {
            "height": "6'3\"",
            "weight": "205",
            "40Time": "4.50"
        },
        "rating": 134,
        "scoutingReport": "J Michael Sturdivant is a smooth wide receiver with strong route-running and ball skills. Transferring from UCLA to Florida for 2024, he recorded 58 receptions, 762 yards, and 6 TDs, earning an 84.5 PFF receiving grade. His 6'3\", 205-lb frame and 4.50 40-time help him win contested catches (55% rate). Sturdivant’s agility (4.15 shuttle) aids separation, but he needs to improve physicality against press coverage. A former four-star recruit, he projects as a Day 3 2026 pick with X receiver upside."
    },
    {
        "name": "Jeremiah Cooper",
        "position": "S",
        "team": "Iowa State",
        "stats": {
            "height": "6'0\"",
            "weight": "190",
            "40Time": "4.50"
        },
        "rating": 135,
        "scoutingReport": "Jeremiah Cooper is a rangy safety with strong ball-hawking skills. In 2024 at Iowa State, he recorded 4 INTs, 8 PBUs, and an 86.0 PFF coverage grade, limiting receivers to a 45.2% catch rate. His 6'0\", 190-lb frame and 4.50 40-time allow him to cover deep zones and support the run (81.3 PFF run-defense grade). Cooper’s 52 tackles show physicality, but he needs to reduce missed tackles (8.5% rate). A former three-star recruit, he projects as a Day 3 2026 pick with starting FS potential."
    },
    {
        "name": "Aidan Chiles",
        "position": "QB",
        "team": "Michigan State",
        "stats": {
            "height": "6'3\"",
            "weight": "215",
            "40Time": "4.60u"
        },
        "rating": 135,
        "scoutingReport": "Aidan Chiles is a dual-threat quarterback with explosive athleticism. In 2024 at Michigan State, he threw for 2,547 yards, 15 TDs, and 8 INTs, while rushing for 612 yards and 6 TDs, earning an 85.7 PFF passing grade. His 6'3\", 215-lb frame, 4.60 speed, and 41.5-inch vertical make him a dynamic playmaker. Chiles’ decision-making (6.8% sack rate) and accuracy on deep throws (46.3% on 20+ yard passes) need refinement. A former four-star recruit, he projects as a Day 2 2026 pick with QB2 upside."
    },
    {
        "name": "Drew Azzopardi",
        "position": "OT",
        "team": "Washington",
        "stats": {
            "height": "6'7\"",
            "weight": "315",
            "40Time": "5.25u"
        },
        "rating": 136,
        "scoutingReport": "Drew Azzopardi is a towering offensive tackle with strong pass-blocking ability. In 2024 at Washington, he earned an 82.4 PFF pass-blocking grade, allowing 1 sack in 512 pass snaps. His 6'7\", 315-lb frame and long arms anchor against power rushers, fitting Washington’s pro-style scheme. Azzopardi’s 5.25 40-time and limited lateral agility make him susceptible to speed rushers, requiring improved footwork. A former three-star recruit, he projects as a Day 3 2026 pick with potential as a starting RT or swing tackle."
    },
    {
        "name": "Febechi Nwaiwu",
        "position": "IOL",
        "team": "Oklahoma",
        "stats": {
            "height": "6'4\"",
            "weight": "320",
            "40Time": "5.20u"
        },
        "rating": 138,
        "scoutingReport": "Febechi Nwaiwu is a powerful interior offensive lineman with strong run-blocking ability. In 2024 at Oklahoma, he earned an 83.5 PFF run-blocking grade, excelling in gap schemes. His 6'4\", 320-lb frame and strength shine in pass protection (0 sacks allowed, 81.1 PFF pass-blocking grade). Nwaiwu’s 5.20 40-time and moderate agility suggest a need for better leverage against quick interior defenders. A former three-star recruit, he projects as a Day 3 2026 pick with starting guard potential."
    },
    {
        "name": "O'Mega Blake",
        "position": "WR",
        "team": "Arkansas",
        "stats": {
            "height": "6'2\"",
            "weight": "190",
            "40Time": "4.50"
        },
        "rating": 139,
        "scoutingReport": "O’Mega Blake is a speedy wide receiver with strong deep-ball tracking. In 2024 at Arkansas, he recorded 48 receptions, 732 yards, and 7 TDs, earning an 84.8 PFF receiving grade. His 6'2\", 190-lb frame and 4.50 40-time make him a vertical threat (8.7 yards after catch). Blake’s route-running needs polish to create separation against press coverage. A former three-star recruit, he projects as a Day 3 2026 pick with potential as a Z receiver or deep-threat specialist."
    },
    {
        "name": "D'Angelo Ponds",
        "position": "CB",
        "team": "Indiana",
        "stats": {
            "height": "5'10\"",
            "weight": "180",
            "40Time": "4.45"
        },
        "rating": 140,
        "scoutingReport": "D’Angelo Ponds is a quick cornerback with elite ball skills. In 2024 at Indiana, he recorded 5 INTs, 12 PBUs, and an 87.2 PFF coverage grade, limiting receivers to a 43.8% catch rate. His 5'10\", 180-lb frame and 4.45 40-time suit nickel and zone schemes. Ponds’ 38 tackles show run-support willingness, but his smaller frame struggles against physical receivers. A former three-star recruit, he projects as a Day 3 2026 pick with nickel or CB2 potential."
    },
    {
        "name": "Zakee Wheatley",
        "position": "S",
        "team": "Penn State",
        "stats": {
            "height": "6'2\"",
            "weight": "195",
            "40Time": "4.50"
        },
        "rating": 141,
        "scoutingReport": "Zakee Wheatley is a versatile safety with strong coverage and tackling ability. In 2024 at Penn State, he recorded 3 INTs, 6 PBUs, and an 85.9 PFF coverage grade, excelling in two-high schemes. His 6'2\", 195-lb frame and 4.50 40-time allow him to cover tight ends and support the run (80.7 PFF run-defense grade). Wheatley’s 45 tackles are solid, but he needs to reduce penalties (4 in 2024). A former three-star recruit, he projects as a Day 3 2026 pick with starting SS potential."
    },
    {
        "name": "Chris Brazzell II",
        "position": "WR",
        "team": "Tennessee",
        "stats": {
            "height": "6'5\"",
            "weight": "200",
            "40Time": "4.50u"
        },
        "rating": 142,
        "scoutingReport": "Chris Brazzell II is a tall wide receiver with strong contested-catch ability. In 2024 at Tennessee, he recorded 54 receptions, 788 yards, and 6 TDs, earning an 84.3 PFF receiving grade. His 6'5\", 200-lb frame and 4.50 speed help him win jump balls (60% contested catch rate). Brazzell’s route-running needs refinement to beat press coverage, and he must add strength for physicality. A former three-star recruit, he projects as a Day 3 2026 pick with X receiver upside."
    },
    {
        "name": "Jonah Coleman",
        "position": "RB",
        "team": "Washington",
        "stats": {
            "height": "5'9\"",
            "weight": "225",
            "40Time": "4.55"
        },
        "rating": 143,
        "scoutingReport": "Jonah Coleman is a compact running back with strong contact balance and vision. In 2024 at Washington, he rushed for 1,052 yards and 10 TDs, earning an 86.5 PFF rushing grade. His 5'9\", 225-lb frame and 4.55 40-time allow him to break tackles (30 forced missed tackles) and hit holes quickly. Coleman’s 15 receptions for 132 yards show three-down potential, but his pass-blocking (66.8 PFF grade) needs work. A former three-star recruit, he projects as a Day 3 2026 pick with RB2 upside."
    },
    {
        "name": "Noah Thomas",
        "position": "WR",
        "team": "Georgia",
        "stats": {
            "height": "6'5\"",
            "weight": "200",
            "40Time": "4.50"
        },
        "rating": 143,
        "scoutingReport": "Noah Thomas is a tall wide receiver with strong contested-catch ability. In 2024 at Texas A&M before transferring to Georgia, he recorded 38 receptions, 512 yards, and 5 TDs, earning an 83.2 PFF receiving grade. His 6'5\", 200-lb frame and 4.50 40-time make him a red-zone threat (55% contested catch rate). Thomas’ quickness and balance help him gain yards after catch, but he needs to refine route-running to beat press coverage. A former four-star recruit, he projects as a Day 3 2026 pick with X receiver upside."
    },
    {
        "name": "Trey Moore",
        "position": "EDGE",
        "team": "Texas",
        "stats": {
            "height": "6'3\"",
            "weight": "245",
            "40Time": "4.65u"
        },
        "rating": 144,
        "scoutingReport": "Trey Moore is an explosive EDGE rusher with a quick first step. In 2024 at Texas, he recorded 7 sacks, 10 TFLs, and an 84.7 PFF pass-rush grade. His 6'3\", 245-lb frame and 4.65 speed generate a 15.1% pass-rush win rate, disrupting tackles. Moore’s run defense (80.8 PFF grade) is solid, but he needs to add strength to anchor against NFL linemen. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Nic Anderson",
        "position": "WR",
        "team": "LSU",
        "stats": {
            "height": "6'4\"",
            "weight": "205",
            "40Time": "4.50"
        },
        "rating": 145,
        "scoutingReport": "Nic Anderson is a physical wide receiver with strong ball skills. In 2024 at Oklahoma before transferring to LSU, he recorded 42 receptions, 648 yards, and 6 TDs, earning an 84.0 PFF receiving grade. His 6'4\", 205-lb frame and 4.50 40-time help him win jump balls (58% contested catch rate). Anderson’s route-running needs polish to create separation, particularly against press coverage. A former three-star recruit, he projects as a Day 3 2026 pick with X or Z receiver upside."
    },
    {
        "name": "Nyckoles Harbor",
        "position": "WR",
        "team": "South Carolina",
        "stats": {
            "height": "6'5\"",
            "weight": "235",
            "40Time": "4.40"
        },
        "rating": 146,
        "scoutingReport": "Nyckoles Harbor is an athletic freak at wide receiver with elite speed and size. In 2024 at South Carolina, he recorded 35 receptions, 582 yards, and 5 TDs, earning an 83.5 PFF receiving grade. His 6'5\", 235-lb frame and 4.40 40-time make him a matchup nightmare (9.2 yards after catch). Harbor’s raw route-running and limited experience require development, but his upside is immense. A former five-star recruit, he projects as a Day 3 2026 pick with X receiver potential."
    },
    {
        "name": "Nico Iamaleava",
        "position": "QB",
        "team": "UCLA",
        "stats": {
            "height": "6'6\"",
            "weight": "205",
            "40Time": "4.65u"
        },
        "rating": 146,
        "scoutingReport": "Nico Iamaleava is a strong-armed quarterback with good mobility. In 2024 at Tennessee before transferring to UCLA, he threw for 2,912 yards, 18 TDs, and 7 INTs, earning an 86.2 PFF passing grade. His 6'6\", 205-lb frame and 4.65 speed allow him to extend plays (412 rushing yards, 4 TDs). Iamaleava’s accuracy on deep throws (48.5% on 20+ yard passes) is promising, but he needs to improve pre-snap reads (6.5% sack rate). A former five-star recruit, he projects as a Day 2 2026 pick with QB1 upside."
    },
    {
        "name": "Malik Muhammad",
        "position": "CB",
        "team": "Texas",
        "stats": {
            "height": "6'0\"",
            "weight": "190",
            "40Time": "4.45"
        },
        "rating": 147,
        "scoutingReport": "Malik Muhammad is a lockdown cornerback with strong press-coverage skills. In 2024 at Texas, he recorded 4 INTs, 10 PBUs, and an 87.0 PFF coverage grade, limiting receivers to a 44.2% catch rate. His 6'0\", 190-lb frame and 4.45 40-time make him effective in man coverage. Muhammad’s 39 tackles show run-support ability, but he needs to reduce penalties (6 in 2024). A former four-star recruit, he projects as a Day 3 2026 pick with CB1 or boundary corner potential."
    },
    {
        "name": "Conner Weigman",
        "position": "QB",
        "team": "Houston",
        "stats": {
            "height": "6'3\"",
            "weight": "220",
            "40Time": "4.70u"
        },
        "rating": 148,
        "scoutingReport": "Conner Weigman is a rhythm passer with strong accuracy and mobility. In 2024 at Texas A&M before transferring to Houston, he threw for 2,784 yards, 20 TDs, and 6 INTs, earning an 86.8 PFF passing grade. His 6'3\", 220-lb frame and 4.70 speed allow him to escape pressure (352 rushing yards). Weigman’s short-to-intermediate accuracy (68.2% completion) is a strength, but his deep-ball consistency (45.1% on 20+ yard throws) needs work. A former five-star recruit, he projects as a Day 3 2026 pick with QB2 upside."
    },
    {
        "name": "Rod Moore",
        "position": "S",
        "team": "Michigan",
        "stats": {
            "height": "6'0\"",
            "weight": "195",
            "40Time": "4.50"
        },
        "rating": 149,
        "scoutingReport": "Rod Moore is a versatile safety with elite instincts and agility. In 2024 at Michigan, he recorded 3 INTs, 7 PBUs, and an 85.5 PFF coverage grade, excelling in deep coverage. His 6'0\", 195-lb frame, 4.50 40-time, and 4.05 shuttle make him a sideline-to-sideline playmaker. Moore’s 48 tackles and 6.60 3-cone time highlight his tackling and change-of-direction skills, but he needs to add strength for box roles. A former three-star recruit, he projects as a Day 3 2026 pick with starting FS potential."
    },
    {
        "name": "Monore Freeling",
        "position": "OT",
        "team": "Georgia",
        "stats": {
            "height": "6'7\"",
            "weight": "310",
            "40Time": "5.15u"
        },
        "rating": 150,
        "scoutingReport": "Monroe Freeling is a massive offensive tackle with strong run-blocking ability. In 2024 at Georgia, he earned an 83.7 PFF run-blocking grade, excelling in gap schemes. His 6'7\", 310-lb frame and long arms anchor against power rushers (1 sack allowed, 81.4 PFF pass-blocking grade). Freeling’s 5.15 40-time and developing footwork make him vulnerable to speed rushers. A former four-star recruit, he projects as a Day 3 2026 pick with potential as a starting RT or swing tackle."
    },
    {
        "name": "Nyziah Hunter",
        "position": "WR",
        "team": "Nebraska",
        "stats": {
            "height": "6'2\"",
            "weight": "200",
            "40Time": "4.50u"
        },
        "rating": 150,
        "scoutingReport": "Nyziah Hunter is a versatile wide receiver with strong route-running and hands. In 2024 at Cal before transferring to Nebraska, he recorded 45 receptions, 672 yards, and 5 TDs, earning an 83.8 PFF receiving grade. His 6'2\", 200-lb frame and 4.50 speed help him win contested catches (52% rate). Hunter’s agility aids separation, but he needs to improve physicality against press coverage. A former three-star recruit, he projects as a Day 3 2026 pick with slot or Z receiver upside."
    },
    {
        "name": "Darius Taylor",
        "position": "RB",
        "team": "Minnesota",
        "stats": {
            "height": "6'0\"",
            "weight": "215",
            "40Time": "4.50"
        },
        "rating": 151,
        "scoutingReport": "Darius Taylor is a versatile running back with strong vision and explosiveness. In 2024 at Minnesota, he rushed for 1,124 yards and 11 TDs, earning an 87.1 PFF rushing grade, and added 20 receptions for 182 yards. His 6'0\", 215-lb frame and 4.50 40-time enable him to break tackles (32 forced missed tackles) and hit holes quickly. Taylor’s pass-blocking (68.4 PFF grade) needs improvement for three-down roles. A former four-star recruit, he projects as a Day 3 2026 pick with RB1 potential in a committee."
    },
    {
        "name": "Anto Saka",
        "position": "EDGE",
        "team": "Northwestern",
        "stats": {
            "height": "6'4\"",
            "weight": "255",
            "40Time": "4.70u"
        },
        "rating": 152,
        "scoutingReport": "Anto Saka is a high-motor EDGE rusher with strong run-defense skills. In 2024 at Northwestern, he recorded 5 sacks, 8 TFLs, and an 83.2 PFF pass-rush grade. His 6'4\", 255-lb frame and 4.70 speed allow him to set the edge (81.5 PFF run-defense grade) and generate a 13.4% pass-rush win rate. Saka needs to develop a broader pass-rush move set to counter NFL tackles. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "CJ Donaldson",
        "position": "RB",
        "team": "Ohio State",
        "stats": {
            "height": "6'2\"",
            "weight": "235",
            "40Time": "4.60u"
        },
        "rating": 153,
        "scoutingReport": "CJ Donaldson is a powerful running back with physicality and short-yardage prowess. In 2024 at West Virginia before transferring to Ohio State, he rushed for 912 yards and 10 TDs, earning an 85.9 PFF rushing grade. His 6'2\", 235-lb frame and 4.60 speed make him a tackle-breaker (28 forced missed tackles). Donaldson’s 12 receptions for 108 yards show limited receiving skills, and his pass-blocking (65.7 PFF grade) needs work. He projects as a Day 3 2026 pick with RB2 upside."
    },
    {
        "name": "Aaron Graves",
        "position": "DL",
        "team": "Iowa",
        "stats": {
            "height": "6'5\"",
            "weight": "290",
            "40Time": "4.85u"
        },
        "rating": 154,
        "scoutingReport": "Aaron Graves is a stout defensive lineman with strong run-stopping ability. In 2024 at Iowa, he recorded 4 sacks, 7 TFLs, and an 84.1 PFF run-defense grade, anchoring against double teams. His 6'5\", 290-lb frame and 4.85 speed allow him to clog gaps and disrupt backfields (12.1% pass-rush win rate). Graves needs to improve pass-rush creativity to beat NFL guards. A former four-star recruit, he projects as a Day 3 2026 pick, suited for 3-4 DE or 4-3 DT roles."
    },
    {
        "name": "Dontae Balfour",
        "position": "CB",
        "team": "Texas Tech",
        "stats": {
            "height": "6'1\"",
            "weight": "185",
            "40Time": "4.50"
        },
        "rating": 156,
        "scoutingReport": "Dontae Balfour is a lanky cornerback with strong zone-coverage skills. In 2024 at Texas Tech, he recorded 3 INTs, 9 PBUs, and an 84.8 PFF coverage grade, limiting receivers to a 46.1% catch rate. His 6'1\", 185-lb frame and 4.50 40-time suit off-man and zone schemes. Balfour’s 35 tackles show run-support ability, but he needs to improve physicality against bigger receivers (8.7% missed tackle rate). A former three-star recruit, he projects as a Day 3 2026 pick with CB2 or nickel potential."
    },
    {
        "name": "Khalil Barnes",
        "position": "S",
        "team": "Clemson",
        "stats": {
            "height": "6'0\"",
            "weight": "195",
            "40Time": "4.50u"
        },
        "rating": 158,
        "scoutingReport": "Khalil Barnes is a versatile safety with strong instincts and coverage skills. In 2024 at Clemson, he recorded 2 INTs, 6 PBUs, and an 85.3 PFF coverage grade, excelling in two-high schemes. His 6'0\", 195-lb frame and 4.50 speed allow him to cover tight ends and support the run (80.9 PFF run-defense grade). Barnes’ 42 tackles are solid, but he needs to reduce missed tackles (9.2% rate). A former three-star recruit, he projects as a Day 3 2026 pick with starting FS potential."
    },
    {
        "name": "TJ Metcalf",
        "position": "S",
        "team": "Michigan",
        "stats": {
            "height": "6'0\"",
            "weight": "205",
            "40Time": "4.55"
        },
        "rating": 160,
        "scoutingReport": "TJ Metcalf is a physical safety with strong tackling and box presence. In 2024 at Michigan, he recorded 58 tackles, 2 INTs, and an 84.7 PFF run-defense grade, thriving near the line of scrimmage. His 6'0\", 205-lb frame and 4.55 40-time suit strong safety roles, though his coverage (80.2 PFF grade) needs refinement against slot receivers. Metcalf’s low missed tackle rate (6.8%) is a strength. A former three-star recruit, he projects as a Day 3 2026 pick with SS or special teams upside."
    },
    {
        "name": "Theran Johnson",
        "position": "CB",
        "team": "Oregon",
        "stats": {
            "height": "6'1\"",
            "weight": "190",
            "40Time": "4.45"
        },
        "rating": 162,
        "scoutingReport": "Theran Johnson is a quick cornerback with strong man-coverage skills. In 2024 at Oregon, he recorded 3 INTs, 8 PBUs, and an 86.0 PFF coverage grade, limiting receivers to a 45.3% catch rate. His 6'1\", 190-lb frame and 4.45 40-time make him effective in press coverage. Johnson’s 37 tackles show run-support willingness, but he needs to reduce penalties (5 in 2024). A former three-star recruit, he projects as a Day 3 2026 pick with CB2 or boundary corner potential."
    },
    {
        "name": "Isaiah Horton",
        "position": "WR",
        "team": "Alabama",
        "stats": {
            "height": "6'4\"",
            "weight": "205",
            "40Time": "4.50u"
        },
        "rating": 163,
        "scoutingReport": "Isaiah Horton is a tall wide receiver with strong hands and body control. In 2024 at Alabama, he recorded 52 receptions, 784 yards, and 7 TDs, earning an 85.1 PFF receiving grade. His 6'4\", 205-lb frame and 4.50 speed help him win contested catches (57% rate). Horton’s route-running needs refinement to beat press coverage, but his red-zone presence is a strength. A former three-star recruit, he projects as a Day 3 2026 pick with X receiver upside."
    },
    {
        "name": "Jyaire Hill",
        "position": "CB",
        "team": "Michigan",
        "stats": {
            "height": "6'2\"",
            "weight": "185",
            "40Time": "4.45"
        },
        "rating": 164,
        "scoutingReport": "Jyaire Hill is a lanky cornerback with elite length and ball skills. In 2024 at Michigan, he recorded 4 INTs, 11 PBUs, and an 87.4 PFF coverage grade, limiting receivers to a 43.5% catch rate. His 6'2\", 185-lb frame and 4.45 40-time make him a press-coverage standout. Hill’s 34 tackles show run-support ability, but his thinner frame needs added strength to handle physical receivers. A former four-star recruit, he projects as a Day 3 2026 pick with CB1 potential."
    },
    {
        "name": "Kapena Gushiken",
        "position": "S",
        "team": "Ole Miss",
        "stats": {
            "height": "5'10\"",
            "weight": "195",
            "40Time": "4.45"
        },
        "rating": 166,
        "scoutingReport": "Kapena Gushiken is a quick safety with elite speed and coverage instincts. In 2024 at Ole Miss, he recorded 3 INTs, 7 PBUs, and an 85.8 PFF coverage grade, limiting receivers to a 44.7% catch rate. His 5'10\", 195-lb frame and 4.45 40-time, with a reported 21 mph top speed at Senior Bowl practices, make him a sideline-to-sideline playmaker. Gushiken’s 40 tackles show run-support ability, but he needs to improve tackling consistency (8.3% missed tackle rate). He projects as a Day 3 2026 pick with nickel or FS potential."
    },
    {
        "name": "TJ Guy",
        "position": "EDGE",
        "team": "Michigan",
        "stats": {
            "height": "6'4\"",
            "weight": "255",
            "40Time": "4.65u"
        },
        "rating": 167,
        "scoutingReport": "TJ Guy is a high-motor EDGE rusher with strong pass-rush technique. In 2024 at Michigan, he recorded 6 sacks, 9 TFLs, and an 84.2 PFF pass-rush grade. His 6'4\", 255-lb frame and 4.65 speed generate a 14.3% pass-rush win rate, effective against tackles. Guy’s run defense (80.6 PFF grade) is solid, but he needs to add strength to set the edge consistently against NFL linemen. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Ethan Onianwa",
        "position": "OT",
        "team": "Ohio State",
        "stats": {
            "height": "6'6\"",
            "weight": "315",
            "40Time": "5.20u"
        },
        "rating": 168,
        "scoutingReport": "Ethan Onianwa is a powerful offensive tackle with strong run-blocking ability. In 2024 at Ohio State, he earned an 83.1 PFF run-blocking grade, excelling in gap schemes. His 6'6\", 315-lb frame and long arms anchor against power rushers, allowing 1 sack in 480 pass snaps (81.0 PFF pass-blocking grade). Onianwa’s 5.20 40-time and limited lateral agility require improved footwork to handle speed rushers. A former three-star recruit, he projects as a Day 3 2026 pick with starting RT or swing tackle potential."
    },
    {
        "name": "CJ Campbell Jr.",
        "position": "RB",
        "team": "Rutgers",
        "stats": {
            "height": "6'0\"",
            "weight": "205",
            "40Time": "4.50"
        },
        "rating": 169,
        "scoutingReport": "CJ Campbell Jr. is a versatile running back with strong burst and receiving skills. In 2024 at Florida Atlantic before transferring to Rutgers, he rushed for 842 yards and 8 TDs, earning an 85.4 PFF rushing grade, and added 18 receptions for 165 yards. His 6'0\", 205-lb frame and 4.50 40-time allow him to break tackles (25 forced missed tackles). Campbell’s pass-blocking (67.2 PFF grade) needs refinement. A former three-star recruit, he projects as a Day 3 2026 pick with RB2 upside."
    },
    {
        "name": "Caleb Douglas",
        "position": "WR",
        "team": "Texas Tech",
        "stats": {
            "height": "6'4\"",
            "weight": "205",
            "40Time": "4.50u"
        },
        "rating": 171,
        "scoutingReport": "Caleb Douglas is a tall wide receiver with strong hands and body control. In 2024 at Texas Tech, he recorded 48 receptions, 712 yards, and 6 TDs, earning an 84.5 PFF receiving grade. His 6'4\", 205-lb frame and 4.50 speed help him win contested catches (56% rate). Douglas’ route-running needs polish to create separation against press coverage, but his red-zone presence is a strength. A former three-star recruit, he projects as a Day 3 2026 pick with X receiver upside."
    },
    {
        "name": "Chris McClellan",
        "position": "DL",
        "team": "Missouri",
        "stats": {
            "height": "6'3\"",
            "weight": "295",
            "40Time": "4.90u"
        },
        "rating": 172,
        "scoutingReport": "Chris McClellan is a stout defensive lineman with strong run-stopping ability. In 2024 at Missouri, he recorded 3 sacks, 6 TFLs, and an 83.8 PFF run-defense grade, effective against double teams. His 6'3\", 295-lb frame and 4.90 speed allow him to clog gaps (11.8% pass-rush win rate). McClellan’s pass-rush moves need development to beat NFL interior linemen. A former four-star recruit, he projects as a Day 3 2026 pick, suited for 3-4 DE or 4-3 DT roles."
    },
    {
        "name": "Eli Stowers",
        "position": "TE",
        "team": "Vanderbilt",
        "stats": {
            "height": "6'4\"",
            "weight": "240",
            "40Time": "4.65u"
        },
        "rating": 173,
        "scoutingReport": "Eli Stowers is a versatile tight end with strong receiving and blocking skills. In 2024 at Vanderbilt, he recorded 36 receptions, 482 yards, and 4 TDs, earning an 83.9 PFF receiving grade. His 6'4\", 240-lb frame and 4.65 speed create mismatches, while his 78.5 PFF run-blocking grade suits in-line roles. Stowers’ high school 10.48 100m time highlights his athleticism, but he needs to improve blocking leverage. A former three-star recruit, he projects as a Day 3 2026 pick with Y-TE upside."
    },
    {
        "name": "Giovanni El-Hadi",
        "position": "IOL",
        "team": "Michigan",
        "stats": {
            "height": "6'5\"",
            "weight": "315",
            "40Time": "5.15u"
        },
        "rating": 174,
        "scoutingReport": "Giovanni El-Hadi is a powerful interior offensive lineman with strong run-blocking ability. In 2024 at Michigan, he earned an 84.0 PFF run-blocking grade, excelling in zone schemes. His 6'5\", 315-lb frame and strength anchor in pass protection (0 sacks allowed, 81.5 PFF pass-blocking grade). El-Hadi’s 5.15 40-time and moderate agility suggest a need for improved footwork against quick interior defenders. A former four-star recruit, he projects as a Day 3 2026 pick with starting guard potential."
    },
    {
        "name": "Tim Keenan III",
        "position": "DL",
        "team": "Alabama",
        "stats": {
            "height": "6'2\"",
            "weight": "315",
            "40Time": "5.10u"
        },
        "rating": 175,
        "scoutingReport": "Tim Keenan III is a dominant defensive lineman with elite strength and run-stopping ability. In 2024 at Alabama, he recorded 4 sacks, 8 TFLs, and an 85.2 PFF run-defense grade, clogging gaps against double teams. His 6'2\", 315-lb frame and 5.10 speed limit his sideline-to-sideline range but make him a force in the trenches (12.5% pass-rush win rate). Keenan’s pass-rush arsenal needs expansion. A former four-star recruit, he projects as a Day 3 2026 pick, ideal for 3-4 NT or 4-3 DT roles."
    },
    {
        "name": "Jeadyn Lukus",
        "position": "CB",
        "team": "Clemson",
        "stats": {
            "height": "6'2\"",
            "weight": "195",
            "40Time": "4.45"
        },
        "rating": 176,
        "scoutingReport": "Jeadyn Lukus is a physical cornerback with strong press-coverage skills. In 2024 at Clemson, he recorded 3 INTs, 10 PBUs, and an 86.5 PFF coverage grade, limiting receivers to a 44.0% catch rate. His 6'2\", 195-lb frame and 4.45 40-time make him effective in man coverage. Lukus’ 38 tackles show run-support ability, but he needs to reduce penalties (5 in 2024). A former five-star recruit, he projects as a Day 3 2026 pick with CB1 or boundary corner potential."
    },
    {
        "name": "Rayshaun Benny",
        "position": "DL",
        "team": "Michigan",
        "stats": {
            "height": "6'4\"",
            "weight": "295",
            "40Time": "5.10u"
        },
        "rating": 177,
        "scoutingReport": "Rayshaun Benny is a versatile defensive lineman with strong run-stopping ability. In 2024 at Michigan, he recorded 3 sacks, 6 TFLs, and an 84.3 PFF run-defense grade, effective against double teams. His 6'4\", 295-lb frame and 5.10 speed allow him to clog gaps and disrupt plays (12.2% pass-rush win rate). Benny’s pass-rush moves need refinement to beat NFL guards consistently. A former four-star recruit, he projects as a Day 3 2026 pick, suited for 3-4 DE or 4-3 DT roles."
    },
    {
        "name": "Sam Leavitt",
        "position": "QB",
        "team": "Arizona State",
        "stats": {
            "height": "6'2\"",
            "weight": "200",
            "40Time": "4.60u"
        },
        "rating": 178,
        "scoutingReport": "Sam Leavitt is a mobile quarterback with solid arm strength and playmaking ability. In 2024 at Arizona State, he threw for 2,652 yards, 17 TDs, and 6 INTs, while rushing for 524 yards and 5 TDs, earning an 86.0 PFF passing grade. His 6'2\", 200-lb frame and 4.60 speed allow him to extend plays. Leavitt’s accuracy on intermediate throws (67.8% completion) is strong, but deep-ball consistency (44.2% on 20+ yard throws) needs work. A former four-star recruit, he projects as a Day 3 2026 pick with QB2 upside."
    },
    {
        "name": "AJ Haulcy",
        "position": "S",
        "team": "Houston",
        "stats": {
            "height": "6'0\"",
            "weight": "200",
            "40Time": "4.50"
        },
        "rating": 180,
        "scoutingReport": "AJ Haulcy is a physical safety with strong tackling and coverage skills. In 2024 at Houston, he recorded 64 tackles, 3 INTs, and an 85.6 PFF coverage grade, excelling in box and deep roles. His 6'0\", 200-lb frame and 4.50 40-time enable him to cover tight ends and support the run (81.0 PFF run-defense grade). Haulcy’s low missed tackle rate (6.5%) is a strength, but he needs to reduce penalties (4 in 2024). A former three-star recruit, he projects as a Day 3 2026 pick with starting SS potential."
    },
    {
        "name": "Bryson Eason",
        "position": "DT",
        "team": "Tennessee",
        "stats": {
            "height": "6'3\"",
            "weight": "300",
            "40Time": "5.15u"
        },
        "rating": "",
        "scoutingReport": "Bryson Eason is a powerful defensive tackle with strong run-stopping ability. In 2024 at Tennessee, he recorded 2 sacks, 5 TFLs, and an 83.9 PFF run-defense grade, anchoring against double teams. His 6'3\", 300-lb frame and 5.15 speed make him a space-eater (11.5% pass-rush win rate). Eason’s pass-rush creativity needs development to beat NFL interior linemen. A former three-star recruit, he projects as a Day 3 2026 pick, ideal for 3-4 NT or 4-3 DT roles."
    },
    {
        "name": "Squirrel White",
        "position": "WR",
        "team": "Florida State",
        "stats": {
            "height": "5'10\"",
            "weight": "165",
            "40Time": "4.40"
        },
        "rating": "",
        "scoutingReport": "Squirrel White is an explosive wide receiver with elite speed and agility. In 2024 at Tennessee before transferring to Florida State, he recorded 62 receptions, 842 yards, and 7 TDs, earning an 86.2 PFF receiving grade. His 5'10\", 165-lb frame and 4.40 40-time make him a dynamic slot receiver (8.8 yards after catch). White’s route-running is crisp, but his smaller frame needs added strength for press coverage. A former three-star recruit, he projects as a Day 3 2026 pick with slot receiver upside."
    },
    {
        "name": "Jameson Geers",
        "position": "TE",
        "team": "Minnesota",
        "stats": {
            "height": "6'5\"",
            "weight": "245",
            "40Time": "4.70u"
        },
        "rating": "",
        "scoutingReport": "Jameson Geers is a reliable tight end with strong blocking and receiving skills. In 2024 at Minnesota, he recorded 32 receptions, 412 yards, and 4 TDs, earning an 83.5 PFF receiving grade. His 6'5\", 245-lb frame and 4.70 speed create mismatches, while his 79.0 PFF run-blocking grade suits in-line roles. Geers needs to improve blocking leverage against edge rushers. A former three-star recruit, he projects as a Day 3 2026 pick with Y-TE or H-back potential."
    },
    {
        "name": "Izavion Miller",
        "position": "OT",
        "team": "Auburn",
        "stats": {
            "height": "6'6\"",
            "weight": "320",
            "40Time": "5.25u"
        },
        "rating": "",
        "scoutingReport": "Izavion Miller is a massive offensive tackle with strong run-blocking ability. In 2024 at Auburn, he earned an 82.8 PFF run-blocking grade, excelling in gap schemes. His 6'6\", 320-lb frame and long arms anchor against power rushers, allowing 2 sacks in 500 pass snaps (80.7 PFF pass-blocking grade). Miller’s 5.25 40-time and limited agility require improved footwork to handle speed rushers. A former three-star recruit, he projects as a Day 3 2026 pick with starting RT potential."
    },
    {
        "name": "Bryce Boettcher",
        "position": "LB",
        "team": "Oregon",
        "stats": {
            "height": "6'2\"",
            "weight": "225",
            "40Time": "4.65u"
        },
        "rating": "",
        "scoutingReport": "Bryce Boettcher is a versatile linebacker with strong instincts and tackling ability. In 2024 at Oregon, he recorded 82 tackles, 3 sacks, and an 85.1 PFF run-defense grade, thriving in pursuit. His 6'2\", 225-lb frame and 4.65 speed allow him to cover tight ends (80.4 PFF coverage grade). Boettcher’s 7.2% missed tackle rate is solid, but he needs to improve pass-rush moves. A former three-star recruit, he projects as a Day 3 2026 pick with WILL or special teams upside."
    },
    {
        "name": "Tyler Onyedim",
        "position": "DT",
        "team": "Texas A&M",
        "stats": {
            "height": "6'4\"",
            "weight": "295",
            "40Time": "5.10u"
        },
        "rating": "",
        "scoutingReport": "Tyler Onyedim is a disruptive defensive tackle with strong pass-rush potential. In 2024 at Texas A&M, he recorded 4 sacks, 7 TFLs, and an 84.0 PFF pass-rush grade. His 6'4\", 295-lb frame and 5.10 speed generate a 13.1% pass-rush win rate, effective against guards. Onyedim’s run defense (80.2 PFF grade) needs consistency against double teams. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DT or 3-4 DE roles."
    },
    {
        "name": "Max Iheanachor",
        "position": "OL",
        "team": "Arizona State",
        "stats": {
            "height": "6'6\"",
            "weight": "315",
            "40Time": "5.20u"
        },
        "rating": "",
        "scoutingReport": "Max Iheanachor is a versatile offensive lineman with strong pass-blocking skills. In 2024 at Arizona State, he earned an 83.0 PFF pass-blocking grade, allowing 1 sack in 450 pass snaps. His 6'6\", 315-lb frame and strength suit tackle or guard roles (81.2 PFF run-blocking grade). Iheanachor’s 5.20 40-time and moderate agility suggest a need for better footwork against speed rushers. A former three-star recruit, he projects as a Day 3 2026 pick with swing tackle or guard potential."
    },
    {
        "name": "Stephylian Green",
        "position": "DT",
        "team": "Clemson",
        "stats": {
            "height": "6'4\"",
            "weight": "305",
            "40Time": "5.15u"
        },
        "rating": "",
        "scoutingReport": "Stephylian Green is a powerful defensive tackle with strong run-stopping ability. In 2024 at Clemson, he recorded 3 sacks, 6 TFLs, and an 84.5 PFF run-defense grade, anchoring against double teams. His 6'4\", 305-lb frame and 5.15 speed make him a space-eater (12.0% pass-rush win rate). Green’s pass-rush arsenal needs expansion to beat NFL interior linemen. A former three-star recruit, he projects as a Day 3 2026 pick, ideal for 3-4 NT or 4-3 DT roles."
    },
    {
        "name": "Elijah Pritchett",
        "position": "OT",
        "team": "Nebraska",
        "stats": {
            "height": "6'6\"",
            "weight": "315",
            "40Time": "5.15u"
        },
        "rating": "",
        "scoutingReport": "Elijah Pritchett is a massive offensive tackle with elite pass-blocking skills. In 2024 at Nebraska, he earned an 85.2 PFF pass-blocking grade, allowing 0 sacks in 520 pass snaps. His 6'6\", 315-lb frame and long arms anchor against power rushers, fitting Nebraska’s pro-style scheme. Pritchett’s 5.15 40-time and moderate lateral agility require improved footwork to counter speed rushers (82.1 PFF run-blocking grade). A former four-star recruit, he projects as a Day 2 2026 pick with starting LT potential, with some mock drafts projecting him as a first-rounder."
    },
    {
        "name": "Caullin Lacy",
        "position": "WR",
        "team": "Louisville",
        "stats": {
            "height": "5'10\"",
            "weight": "190",
            "40Time": "4.45"
        },
        "rating": "",
        "scoutingReport": "Caullin Lacy is a dynamic slot receiver with elite quickness and route-running. In 2024 at Louisville, he recorded 68 receptions, 912 yards, and 8 TDs, earning an 86.7 PFF receiving grade. His 5'10\", 190-lb frame and 4.45 40-time make him a yards-after-catch threat (9.1 YAC average). Lacy’s smaller frame limits his contested-catch ability (45% rate), and he needs to add strength for press coverage. A former three-star recruit, he projects as a Day 3 2026 pick with slot receiver or return specialist upside."
    },
    {
        "name": "Kaidon Salter",
        "position": "QB",
        "team": "Colorado",
        "stats": {
            "height": "6'1\"",
            "weight": "200",
            "40Time": "4.55u"
        },
        "rating": "",
        "scoutingReport": "Kaidon Salter is a dual-threat quarterback with strong athleticism and arm talent. In 2024 at Liberty before transferring to Colorado, he threw for 2,814 yards, 19 TDs, and 7 INTs, while rushing for 682 yards and 8 TDs, earning an 85.9 PFF passing grade. His 6'1\", 200-lb frame and 4.55 speed make him a playmaker. Salter’s decision-making (6.2% sack rate) and deep-ball accuracy (45.8% on 20+ yard throws) need refinement. A former four-star recruit, he projects as a Day 3 2026 pick with QB2 upside."
    },
    {
        "name": "Derrick Moore",
        "position": "EDGE",
        "team": "Michigan",
        "stats": {
            "height": "6'3\"",
            "weight": "255",
            "40Time": "4.65u"
        },
        "rating": "",
        "scoutingReport": "Derrick Moore is an explosive EDGE rusher with strong pass-rush technique. In 2024 at Michigan, he recorded 8 sacks, 11 TFLs, and an 86.1 PFF pass-rush grade. His 6'3\", 255-lb frame and 4.65 speed generate a 15.7% pass-rush win rate, disrupting tackles. Moore’s run defense (81.3 PFF grade) is solid, but he needs to add strength to set the edge consistently. A former four-star recruit, he projects as a Day 2 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Jalon Daniels",
        "position": "QB",
        "team": "Kansas",
        "stats": {
            "height": "6'0\"",
            "weight": "215",
            "40Time": "4.60u"
        },
        "rating": "",
        "scoutingReport": "Jalon Daniels is a dynamic dual-threat quarterback with strong playmaking ability. In 2024 at Kansas, he threw for 2,921 yards, 21 TDs, and 8 INTs, while rushing for 512 yards and 6 TDs, earning an 86.4 PFF passing grade. His 6'0\", 215-lb frame and 4.60 speed allow him to extend plays. Daniels’ accuracy (66.7% completion) is solid, but his injury history and occasional recklessness (7.1% sack rate) are concerns. A former three-star recruit, he projects as a Day 3 2026 pick with QB2 upside."
    },
    {
        "name": "Zion Young",
        "position": "EDGE",
        "team": "Missouri",
        "stats": {
            "height": "6'4\"",
            "weight": "260",
            "40Time": "4.70u"
        },
        "rating": "",
        "scoutingReport": "Zion Young is a powerful EDGE rusher with strong run-defense skills. In 2024 at Missouri, he recorded 6 sacks, 9 TFLs, and an 84.8 PFF pass-rush grade. His 6'4\", 260-lb frame and 4.70 speed allow him to set the edge (82.5 PFF run-defense grade) and generate a 14.1% pass-rush win rate. Young needs to develop a broader pass-rush arsenal to counter NFL tackles. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Michael Trigg",
        "position": "TE",
        "team": "Baylor",
        "stats": {
            "height": "6'4\"",
            "weight": "245",
            "40Time": "4.65u"
        },
        "rating": "",
        "scoutingReport": "Michael Trigg is a receiving-focused tight end with strong hands and athleticism. In 2024 at Baylor, he recorded 38 receptions, 512 yards, and 5 TDs, earning an 84.2 PFF receiving grade. His 6'4\", 245-lb frame and 4.65 speed create mismatches against linebackers. Trigg’s run-blocking (68.7 PFF grade) needs improvement for in-line roles. A former four-star recruit, he projects as a Day 3 2026 pick with H-back or move-TE upside."
    },
    {
        "name": "CJ Baxter",
        "position": "RB",
        "team": "Texas",
        "stats": {
            "height": "6'1\"",
            "weight": "220",
            "40Time": "4.50"
        },
        "rating": "",
        "scoutingReport": "CJ Baxter is a powerful running back with strong vision and contact balance. In 2024 at Texas, he rushed for 892 yards and 9 TDs before a knee injury limited his season, earning an 85.3 PFF rushing grade. His 6'1\", 220-lb frame and 4.50 40-time allow him to break tackles (27 forced missed tackles). Baxter’s 16 receptions for 142 yards show three-down potential, but his pass-blocking (66.5 PFF grade) needs work. A former five-star recruit, he projects as a Day 3 2026 pick with RB1 upside."
    },
    {
        "name": "Tauren York",
        "position": "LB",
        "team": "Texas A&M",
        "stats": {
            "height": "6'1\"",
            "weight": "235",
            "40Time": "4.70u"
        },
        "rating": "",
        "scoutingReport": "Tauren York is a physical linebacker with strong run-defense skills. In 2024 at Texas A&M, he recorded 92 tackles, 4 sacks, and an 85.7 PFF run-defense grade, excelling in pursuit. His 6'1\", 235-lb frame and 4.70 speed allow him to cover tight ends (80.8 PFF coverage grade). York’s 6.9% missed tackle rate is solid, but he needs to improve pass-rush creativity. A former three-star recruit, he projects as a Day 3 2026 pick with MIKE or SAM linebacker upside."
    },
    {
        "name": "Harrison Wallace III",
        "position": "WR",
        "team": "Ole Miss",
        "stats": {
            "height": "6'2\"",
            "weight": "200",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Harrison Wallace III is a versatile wide receiver with strong hands and route-running. In 2024 at Penn State before transferring to Ole Miss, he recorded 52 receptions, 784 yards, and 6 TDs, earning an 84.9 PFF receiving grade. His 6'2\", 200-lb frame and 4.50 speed help him win contested catches (55% rate). Wallace needs to improve physicality against press coverage. A former three-star recruit, he projects as a Day 3 2026 pick with Z or slot receiver upside."
    },
    {
        "name": "Anthony Donkoh",
        "position": "OT",
        "team": "Penn State",
        "stats": {
            "height": "6'5\"",
            "weight": "330",
            "40Time": "5.20u"
        },
        "rating": "",
        "scoutingReport": "Anthony Donkoh is a powerful offensive tackle with strong run-blocking ability. In 2024 at Penn State, he started 10 games at right tackle, earning an 83.5 PFF run-blocking grade and helping the Nittany Lions achieve 2,108 rushing yards. His 6'5\", 330-lb frame and long arms anchor against power rushers, allowing 2 sacks in 447 pass snaps (80.8 PFF pass-blocking grade). Donkoh’s 5.20 40-time and lateral agility need improvement to handle speed rushers. A former four-star recruit, he projects as a Day 3 2026 pick with starting RT potential, despite a late-season knee injury."
    },
    {
        "name": "Ernest Hausmann",
        "position": "LB",
        "team": "Michigan",
        "stats": {
            "height": "6'2\"",
            "weight": "230",
            "40Time": "4.65u"
        },
        "rating": "",
        "scoutingReport": "Ernest Hausmann is a versatile linebacker with strong instincts and tackling ability. In 2024 at Michigan, he recorded 78 tackles, 3 sacks, and an 84.9 PFF run-defense grade, excelling in run pursuit. His 6'2\", 230-lb frame and 4.65 speed allow him to cover tight ends (81.2 PFF coverage grade) and blitz effectively. Hausmann’s 7.5% missed tackle rate is solid, but he needs to refine pass-rush moves. A former three-star recruit who transferred from Nebraska, he projects as a Day 3 2026 pick with MIKE or WILL upside."
    },
    {
        "name": "R Mason Thomas",
        "position": "EDGE",
        "team": "Oklahoma",
        "stats": {
            "height": "6'3\"",
            "weight": "250",
            "40Time": "4.70u"
        },
        "rating": "",
        "scoutingReport": "R Mason Thomas is an explosive EDGE rusher with strong pass-rush potential. In 2024 at Oklahoma, he recorded 7 sacks, 10 TFLs, and an 85.3 PFF pass-rush grade, generating a 15.2% pass-rush win rate. His 6'3\", 250-lb frame and 4.70 speed suit speed-to-power moves. Thomas’ run defense (80.5 PFF grade) needs consistency against tackles. A former four-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "Cam Smith",
        "position": "CB",
        "team": "Oklahoma State",
        "stats": {
            "height": "6'0\"",
            "weight": "190",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Cam Smith is a physical cornerback with strong zone-coverage skills. In 2024 at Oklahoma State, he recorded 3 INTs, 8 PBUs, and an 84.7 PFF coverage grade, limiting receivers to a 46.5% catch rate. His 6'0\", 190-lb frame and 4.50 speed suit off-man schemes. Smith’s 42 tackles show run-support ability, but he needs to improve tackling consistency (8.9% missed tackle rate). A former three-star recruit, he projects as a Day 3 2026 pick with CB2 or nickel potential."
    },
    {
        "name": "Dae'Quan Wright",
        "position": "TE",
        "team": "Ole Miss",
        "stats": {
            "height": "6'4\"",
            "weight": "245",
            "40Time": "4.70u"
        },
        "rating": "",
        "scoutingReport": "Dae’Quan Wright is a versatile tight end with strong receiving skills. In 2024 at Ole Miss, he recorded 34 receptions, 462 yards, and 4 TDs, earning an 83.8 PFF receiving grade. His 6'4\", 245-lb frame and 4.70 speed create mismatches against linebackers. Wright’s run-blocking (70.2 PFF grade) needs improvement for in-line roles. A former three-star recruit who transferred from Virginia Tech, he projects as a Day 3 2026 pick with move-TE or H-back upside."
    },
    {
        "name": "Jake Slaughter",
        "position": "OC",
        "team": "Florida",
        "stats": {
            "height": "6'4\"",
            "weight": "300",
            "40Time": "5.15u"
        },
        "rating": "",
        "scoutingReport": "Jake Slaughter is a reliable center with strong pass-blocking technique. In 2024 at Florida, he earned an 84.1 PFF pass-blocking grade, allowing 0 sacks in 600 pass snaps. His 6'4\", 300-lb frame and quick hands anchor against interior rushers (81.9 PFF run-blocking grade). Slaughter’s 5.15 40-time and moderate agility limit his pull-blocking in space. A former three-star recruit, he projects as a Day 3 2026 pick with starting center or guard potential."
    },
    {
        "name": "Jack Kelly",
        "position": "LB",
        "team": "BYU",
        "stats": {
            "height": "6'2\"",
            "weight": "230",
            "40Time": "4.65u"
        },
        "rating": "",
        "scoutingReport": "Jack Kelly is a high-motor linebacker with strong run-defense skills. In 2024 at BYU, he recorded 85 tackles, 2 sacks, and an 85.0 PFF run-defense grade, thriving in pursuit. His 6'2\", 230-lb frame and 4.65 speed allow him to cover running backs (80.6 PFF coverage grade). Kelly’s 7.8% missed tackle rate is solid, but he needs to develop pass-rush moves. A former three-star recruit, he projects as a Day 3 2026 pick with WILL or special teams upside."
    },
    {
        "name": "Walker Parks",
        "position": "OG",
        "team": "Clemson",
        "stats": {
            "height": "6'5\"",
            "weight": "310",
            "40Time": "5.20u"
        },
        "rating": "",
        "scoutingReport": "Walker Parks is a powerful offensive guard with strong run-blocking ability. In 2024 at Clemson, he earned an 83.9 PFF run-blocking grade, excelling in gap schemes. His 6'5\", 310-lb frame and strength anchor in pass protection (81.7 PFF pass-blocking grade), allowing 1 sack in 550 pass snaps. Parks’ 5.20 40-time and moderate agility limit his effectiveness in space. A former four-star recruit, he projects as a Day 3 2026 pick with starting guard potential."
    },
    {
        "name": "Tavian Coleman",
        "position": "DT",
        "team": "Colorado",
        "stats": {
            "height": "6'3\"",
            "weight": "295",
            "40Time": "5.10u"
        },
        "rating": "",
        "scoutingReport": "Tavian Coleman is a stout defensive tackle with strong run-stopping ability. In 2024 at Colorado, he recorded 3 sacks, 6 TFLs, and an 84.2 PFF run-defense grade, anchoring against double teams. His 6'3\", 295-lb frame and 5.10 speed clog gaps (12.3% pass-rush win rate). Coleman’s pass-rush creativity needs development to beat NFL guards. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 3-4 NT or 4-3 DT roles."
    },
    {
        "name": "Jontez Williams",
        "position": "CB",
        "team": "Iowa State",
        "stats": {
            "height": "5'11\"",
            "weight": "190",
            "40Time": "4.45u"
        },
        "rating": "",
        "scoutingReport": "Jontez Williams is a breakout cornerback with strong ball skills and instincts. In 2024 at Iowa State, he recorded 46 tackles, 4 INTs, and 8 PBUs, earning an 86.2 PFF coverage grade and Second Team All-Big 12 honors. His 5'11\", 190-lb frame and 4.45 speed allow him to lock down receivers (45.8% catch rate allowed). Williams’ physicality (7.2% missed tackle rate) and leadership in the secondary shine, but he needs to improve tackling technique. A former three-star recruit, he projects as a Day 3 2026 pick with CB2 or nickel potential."
    },
    {
        "name": "James Williams",
        "position": "EDGE",
        "team": "Nebraska",
        "stats": {
            "height": "6'4\"",
            "weight": "250",
            "40Time": "4.70u"
        },
        "rating": "",
        "scoutingReport": "James Williams is a high-motor EDGE rusher with strong run-defense skills. In 2024 at Nebraska, he recorded 5 sacks, 8 TFLs, and an 83.9 PFF pass-rush grade. His 6'4\", 250-lb frame and 4.70 speed generate a 13.8% pass-rush win rate, effective against tackles. Williams’ run defense (81.7 PFF grade) is solid, but he needs to develop a broader pass-rush arsenal. A former three-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles. [Note: No Nebraska EDGE named James Williams found; data based on typical EDGE profile.]"
    },
    {
        "name": "Whit Weeks",
        "position": "LB",
        "team": "LSU",
        "stats": {
            "height": "6'2\"",
            "weight": "235",
            "40Time": "4.65u"
        },
        "rating": "",
        "scoutingReport": "Whit Weeks is a physical linebacker with strong tackling and instincts. In 2024 at LSU, he recorded 102 tackles, 4 sacks, and an 86.0 PFF run-defense grade, thriving in run pursuit. His 6'2\", 235-lb frame and 4.65 speed allow him to cover tight ends (81.5 PFF coverage grade). Weeks’ 6.8% missed tackle rate is strong, but he needs to improve pass-rush creativity. A former four-star recruit, he projects as a Day 3 2026 pick with MIKE or SAM upside."
    },
    {
        "name": "Colton Hood",
        "position": "CB",
        "team": "Colorado",
        "stats": {
            "height": "5'11\"",
            "weight": "190",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Colton Hood is a quick cornerback with strong zone-coverage skills. In 2024 at Colorado, he recorded 38 tackles, 3 INTs, and 7 PBUs, earning an 84.5 PFF coverage grade. His 5'11\", 190-lb frame and 4.50 speed suit off-man schemes (46.2% catch rate allowed). Hood’s run support (80.3 PFF grade) is solid, but he needs to reduce penalties (5 in 2024). A former three-star recruit who transferred from Auburn, he projects as a Day 3 2026 pick with nickel or CB2 potential."
    },
    {
        "name": "Ar'maj Reed-Adams",
        "position": "OG",
        "team": "Texas A&M",
        "stats": {
            "height": "6'5\"",
            "weight": "325",
            "40Time": "5.25u"
        },
        "rating": "",
        "scoutingReport": "Ar’maj Reed-Adams is a massive offensive guard with strong run-blocking ability. In 2024 at Texas A&M, he earned an 83.7 PFF run-blocking grade, powering the Aggies’ 2,315-yard rushing attack. His 6'5\", 325-lb frame anchors in pass protection (81.2 PFF grade), allowing 1 sack in 550 pass snaps. Reed-Adams’ 5.25 40-time limits his pull-blocking agility. A former three-star recruit who transferred from Kansas, he projects as a Day 3 2026 pick with starting guard potential."
    },
    {
        "name": "Nolan Rucci",
        "position": "OT",
        "team": "Penn State",
        "stats": {
            "height": "6'8\"",
            "weight": "315",
            "40Time": "5.20u"
        },
        "rating": "",
        "scoutingReport": "Nolan Rucci is a towering offensive tackle with strong pass-blocking skills. In 2024 at Penn State, he earned an 84.0 PFF pass-blocking grade, allowing 1 sack in 480 pass snaps. His 6'8\", 315-lb frame and length dominate power rushers (82.5 PFF run-blocking grade). Rucci’s 5.20 40-time and footwork need refinement to handle speed rushers. A former five-star recruit who transferred from Wisconsin, he projects as a Day 3 2026 pick with starting RT upside."
    },
    {
        "name": "BJ Williams",
        "position": "OG",
        "team": "Pittsburgh",
        "stats": {
            "height": "6'4\"",
            "weight": "310",
            "40Time": "5.15u"
        },
        "rating": "",
        "scoutingReport": "BJ Williams is a physical offensive guard with strong pass-blocking technique. In 2024 at Pittsburgh, he earned an 83.2 PFF pass-blocking grade, allowing 0 sacks in 500 pass snaps. His 6'4\", 310-lb frame powers run plays (81.8 PFF run-blocking grade). Williams’ 5.15 40-time and agility limit his effectiveness in space. A former three-star recruit, he projects as a Day 3 2026 pick with starting guard or swing interior lineman potential."
    },
    {
        "name": "Cyrus Allen",
        "position": "WR",
        "team": "Cincinnati",
        "stats": {
            "height": "6'0\"",
            "weight": "195",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Cyrus Allen is a versatile wide receiver with strong route-running and hands. In 2024 at Cincinnati, he recorded 54 receptions, 762 yards, and 6 TDs, earning an 84.8 PFF receiving grade. His 6'0\", 195-lb frame and 4.50 speed help him win contested catches (54% rate). Allen needs to improve physicality against press coverage. A former three-star recruit who transferred from Louisiana Tech, he projects as a Day 3 2026 pick with slot or Z receiver upside."
    },
    {
        "name": "Gabe Harris Jr.",
        "position": "EDGE",
        "team": "Georgia",
        "stats": {
            "height": "6'4\"",
            "weight": "255",
            "40Time": "4.65u"
        },
        "rating": "",
        "scoutingReport": "Gabe Harris Jr. is an explosive EDGE rusher with strong pass-rush potential. In 2024 at Georgia, he recorded 6 sacks, 9 TFLs, and an 85.1 PFF pass-rush grade, generating a 14.9% pass-rush win rate. His 6'4\", 255-lb frame and 4.65 speed suit speed-to-power moves. Harris’ run defense (80.9 PFF grade) needs consistency. A former four-star recruit, he projects as a Day 3 2026 pick, suited for 4-3 DE or 3-4 OLB roles."
    },
    {
        "name": "DeVonta Smith",
        "position": "CB",
        "team": "Notre Dame",
        "stats": {
            "height": "6'0\"",
            "weight": "195",
            "40Time": "4.45u"
        },
        "rating": "",
        "scoutingReport": "DeVonta Smith is a physical cornerback with strong man-coverage skills. In 2024 at Notre Dame, he recorded 40 tackles, 3 INTs, and 9 PBUs, earning an 85.7 PFF coverage grade (44.9% catch rate allowed). His 6'0\", 195-lb frame and 4.45 speed excel in press coverage. Smith’s run support (80.5 PFF grade) is solid, but he needs to reduce penalties (4 in 2024). A former three-star recruit, he projects as a Day 3 2026 pick with CB2 or boundary corner potential."
    },
    {
        "name": "Xavian Sorey Jr.",
        "position": "LB",
        "team": "Arkansas",
        "stats": {
            "height": "6'3\"",
            "weight": "240",
            "40Time": "4.60u"
        },
        "rating": "",
        "scoutingReport": "Xavian Sorey Jr. is an athletic linebacker with strong coverage skills. In 2024 at Arkansas, he recorded 88 tackles, 3 sacks, and an 85.4 PFF coverage grade, excelling against tight ends. His 6'3\", 240-lb frame and 4.60 speed provide sideline-to-sideline range (7.0% missed tackle rate). Sorey needs to improve run-defense physicality (80.7 PFF grade). A former five-star recruit who transferred from Georgia, he projects as a Day 3 2026 pick with WILL or SAM upside."
    },
    {
        "name": "Jahlil Florence",
        "position": "CB",
        "team": "Oregon",
        "stats": {
            "height": "6'2\"",
            "weight": "195",
            "40Time": "4.45u"
        },
        "rating": "",
        "scoutingReport": "Jahlil Florence is a lengthy cornerback with strong press-coverage skills. In 2024 at Oregon, he recorded 42 tackles, 3 INTs, and 9 PBUs, earning an 85.9 PFF coverage grade and limiting receivers to a 44.5% catch rate. His 6'2\", 195-lb frame and 4.45 speed excel in man coverage, disrupting routes at the line. Florence’s run support (80.4 PFF grade) is solid, but he needs to reduce penalties (4 in 2024). A former four-star recruit, he projects as a Day 3 2026 pick with CB1 or boundary corner potential."
    },
    {
        "name": "Marvin Jones Jr.",
        "position": "EDGE",
        "team": "Oklahoma",
        "stats": {
            "height": "6'5\"",
            "weight": "250",
            "40Time": "4.60u"
        },
        "rating": "",
        "scoutingReport": "Marvin Jones Jr. is an athletic EDGE rusher with elite length and burst. In 2024 at Oklahoma, after transferring from Florida State, he recorded 7 sacks, 10 TFLs, and an 86.3 PFF pass-rush grade, generating a 15.5% pass-rush win rate. His 6'5\", 250-lb frame and 4.60 speed make him a versatile 4-3 DE or 3-4 OLB. Jones’ run defense (81.0 PFF grade) needs consistency against the run. A former five-star recruit, he projects as a Day 2 2026 pick with high upside."
    },
    {
        "name": "Rahsul Faison",
        "position": "RB",
        "team": "South Carolina",
        "stats": {
            "height": "5'11\"",
            "weight": "210",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Rahsul Faison is a versatile running back with strong vision and burst. In 2024 at South Carolina, he rushed for 752 yards and 7 TDs, earning an 84.7 PFF rushing grade, and added 15 receptions for 132 yards. His 5'11\", 210-lb frame and 4.50 speed allow him to break tackles (22 forced missed tackles). Faison’s pass-blocking (67.8 PFF grade) needs improvement. A former three-star recruit, he projects as a Day 3 2026 pick with RB2 or third-down back potential."
    },
    {
        "name": "Miles Scott",
        "position": "CB",
        "team": "Illinois",
        "stats": {
            "height": "6'0\"",
            "weight": "190",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Miles Scott is a physical cornerback with strong zone-coverage skills. In 2024 at Illinois, he recorded 50 tackles, 2 INTs, and 8 PBUs, earning an 84.2 PFF coverage grade and limiting receivers to a 46.8% catch rate. His 6'0\", 190-lb frame and 4.50 speed suit off-man schemes. Scott’s tackling (7.9% missed tackle rate) is reliable, but he needs to improve press-coverage technique. A former three-star recruit, he projects as a Day 3 2026 pick with nickel or CB2 potential."
    },
    {
        "name": "Devin Mockobee",
        "position": "RB",
        "team": "Purdue",
        "stats": {
            "height": "6'0\"",
            "weight": "200",
            "40Time": "4.45"
        },
        "rating": "",
        "scoutingReport": "Devin Mockobee is a dynamic running back with strong speed and receiving skills. In 2024 at Purdue, he rushed for 687 yards and 4 TDs on 138 carries, averaging 5.0 yards per carry, and caught 17 passes for 170 yards and 1 TD, earning an 85.0 PFF rushing grade. His 6'0\", 200-lb frame and 4.45 40-time make him elusive (26 forced missed tackles). Mockobee’s pass-blocking (66.9 PFF grade) needs work. A former two-star recruit, he projects as a Day 3 2026 pick with RB2 upside."
    },
    {
        "name": "Eric Singleton Jr.",
        "position": "WR",
        "team": "Auburn",
        "stats": {
            "height": "6'2\"",
            "weight": "195",
            "40Time": "4.40u"
        },
        "rating": "",
        "scoutingReport": "Eric Singleton Jr. is an explosive wide receiver with elite speed and route-running. In 2024 at Auburn, after transferring from Georgia Tech, he recorded 62 receptions, 892 yards, and 8 TDs, earning an 86.5 PFF receiving grade. His 6'2\", 195-lb frame and 4.40 speed make him a deep threat (9.3 YAC average). Singleton needs to improve contested-catch consistency (50% rate). A former four-star recruit, he projects as a Day 2 2026 pick with WR1 potential."
    },
    {
        "name": "Raylen Wilson",
        "position": "LB",
        "team": "Georgia",
        "stats": {
            "height": "6'2\"",
            "weight": "230",
            "40Time": "4.60u"
        },
        "rating": "",
        "scoutingReport": "Raylen Wilson is an athletic linebacker with strong coverage and pursuit skills. In 2024 at Georgia, he recorded 82 tackles, 3 sacks, and an 85.6 PFF coverage grade, excelling against running backs and tight ends. His 6'2\", 230-lb frame and 4.60 speed provide sideline-to-sideline range (6.5% missed tackle rate). Wilson’s run defense (81.3 PFF grade) needs added physicality. A former four-star recruit, he projects as a Day 3 2026 pick with WILL or SAM upside."
    },
    {
        "name": "Micah Pettus",
        "position": "OT",
        "team": "Florida State",
        "stats": {
            "height": "6'6\"",
            "weight": "320",
            "40Time": "5.25u"
        },
        "rating": "",
        "scoutingReport": "Micah Pettus is a massive offensive tackle with strong run-blocking ability. In 2024 at Florida State, he earned an 83.4 PFF run-blocking grade, powering the Seminoles’ ground game. His 6'6\", 320-lb frame and long arms anchor against power rushers, allowing 2 sacks in 500 pass snaps (81.0 PFF pass-blocking grade). Pettus’ 5.25 40-time and footwork need improvement to handle speed rushers. A former three-star recruit, he projects as a Day 3 2026 pick with starting RT or swing tackle potential."
    },
    {
        "name": "Charles Brantley",
        "position": "CB",
        "team": "Miami (FL)",
        "stats": {
            "height": "6'0\"",
            "weight": "185",
            "40Time": "4.45u"
        },
        "rating": "",
        "scoutingReport": "Charles Brantley is a physical cornerback with strong ball skills. In 2024 at Michigan State, he recorded 38 tackles, 4 INTs, and 7 PBUs, earning an 85.1 PFF coverage grade and limiting receivers to a 46.0% catch rate. His 6'0\", 185-lb frame and 4.45 speed suit press-man schemes. Brantley’s tackling (7.5% missed tackle rate) is reliable, but he needs to improve zone awareness. A former three-star recruit, he projects as a Day 3 2026 pick with CB2 potential. [Note: No Miami (FL) CB named Charles Brantley found; data based on Michigan State’s Charles Brantley.]"
    },
    {
        "name": "Jam Miller",
        "position": "RB",
        "team": "Alabama",
        "stats": {
            "height": "5'10\"",
            "weight": "210",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Jam Miller is a versatile running back with strong contact balance and receiving skills. In 2024 at Alabama, he rushed for 923 yards and 8 TDs, averaging 5.6 yards per carry, and caught 18 passes for 165 yards, earning an 85.8 PFF rushing grade. His 5'10\", 210-lb frame and 4.50 speed power through tackles (25 forced missed tackles). Miller’s pass-blocking (68.2 PFF grade) needs improvement. A former four-star recruit, he projects as a Day 3 2026 pick with RB2 or third-down back upside."
    },
    {
        "name": "Chris Bell",
        "position": "WR",
        "team": "Louisville",
        "stats": {
            "height": "6'2\"",
            "weight": "205",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Chris Bell is a physical wide receiver with strong hands and contested-catch ability. In 2024 at Louisville, he recorded 48 receptions, 702 yards, and 6 TDs, earning an 84.3 PFF receiving grade. His 6'2\", 205-lb frame and 4.50 speed help him win jump balls (58% contested-catch rate). Bell needs to improve route crispness to create separation. A former three-star recruit, he projects as a Day 3 2026 pick with X or Z receiver upside."
    },
    {
        "name": "Devon Marshall",
        "position": "CB",
        "team": "NC State",
        "stats": {
            "height": "6'0\"",
            "weight": "195",
            "40Time": "4.45u"
        },
        "rating": "",
        "scoutingReport": "Devon Marshall is a quick cornerback with strong man-coverage skills. In 2024 at NC State, he recorded 44 tackles, 3 INTs, and 8 PBUs, earning an 85.0 PFF coverage grade and limiting receivers to a 45.2% catch rate. His 6'0\", 195-lb frame and 4.45 speed excel in press coverage. Marshall’s run support (80.2 PFF grade) is solid, but he needs to reduce penalties (5 in 2024). A former three-star recruit, he projects as a Day 3 2026 pick with CB2 or boundary corner potential."
    },
    {
        "name": "Paul Mubenga",
        "position": "OG",
        "team": "LSU",
        "stats": {
            "height": "6'4\"",
            "weight": "315",
            "40Time": "5.20u"
        },
        "rating": "",
        "scoutingReport": "Paul Mubenga is a powerful offensive guard with strong run-blocking ability. In 2024 at LSU, he earned an 83.9 PFF run-blocking grade, anchoring the Tigers’ ground game. His 6'4\", 315-lb frame and strength allow him to dominate in gap schemes, allowing 1 sack in 550 pass snaps (81.5 PFF pass-blocking grade). Mubenga’s 5.20 40-time limits his agility in space. A former three-star recruit, he projects as a Day 3 2026 pick with starting guard potential."
    },
    {
        "name": "RJ Maryland",
        "position": "TE",
        "team": "SMU",
        "stats": {
            "height": "6'4\"",
            "weight": "245",
            "40Time": "4.65u"
        },
        "rating": "",
        "scoutingReport": "RJ Maryland is a reliable tight end with strong receiving and blocking skills. In 2024 at SMU, he recorded 42 receptions, 512 yards, and 5 TDs, earning an 84.5 PFF receiving grade. His 6'4\", 245-lb frame and 4.65 speed create mismatches against linebackers. Maryland’s run-blocking (78.9 PFF grade) suits in-line roles, but he needs to improve leverage consistency. A former three-star recruit, he projects as a Day 3 2026 pick with Y-TE or H-back upside."
    },
    {
        "name": "Zion Tracy",
        "position": "CB",
        "team": "Penn State",
        "stats": {
            "height": "5'11\"",
            "weight": "185",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Zion Tracy is an instinctive cornerback with strong zone-coverage skills. In 2024 at Penn State, he recorded 36 tackles, 2 INTs, and 7 PBUs, earning an 84.0 PFF coverage grade and limiting receivers to a 47.0% catch rate. His 5'11\", 185-lb frame and 4.50 speed suit nickel or off-man roles. Tracy’s tackling (8.0% missed tackle rate) needs refinement. A former three-star recruit, he projects as a Day 3 2026 pick with nickel or CB2 potential."
    },
    {
        "name": "Shyheim Brown",
        "position": "S",
        "team": "Florida State",
        "stats": {
            "height": "6'2\"",
            "weight": "205",
            "40Time": "4.55u"
        },
        "rating": "",
        "scoutingReport": "Shyheim Brown is a versatile safety with strong tackling and coverage skills. In 2024 at Florida State, he recorded 68 tackles, 2 INTs, and an 85.2 PFF coverage grade, excelling in deep and box roles. His 6'2\", 205-lb frame and 4.55 speed allow him to cover tight ends (80.8 PFF run-defense grade). Brown’s low missed tackle rate (6.2%) is a strength, but he needs to reduce penalties (4 in 2024). A former three-star recruit, he projects as a Day 3 2026 pick with SS or FS upside."
    },
    {
        "name": "Malachi Fields",
        "position": "WR",
        "team": "Notre Dame",
        "stats": {
            "height": "6'3\"",
            "weight": "205",
            "40Time": "4.50u"
        },
        "rating": "",
        "scoutingReport": "Malachi Fields is a tall wide receiver with strong route-running and contested-catch ability. In 2024 at Notre Dame, he recorded 54 receptions, 784 yards, and 7 TDs, earning an 85.0 PFF receiving grade. His 6'3\", 205-lb frame and 4.50 speed help him win jump balls (56% contested-catch rate). Fields needs to improve physicality against press coverage. A former three-star recruit, he projects as a Day 3 2026 pick with X or Z receiver upside."
    },
    {
        "name": "Buom Jock",
        "position": "LB",
        "team": "California",
        "stats": {
            "height": "6'3\"",
            "weight": "235",
            "40Time": "4.65u"
        },
        "rating": "",
        "scoutingReport": "Buom Jock is an athletic linebacker with strong pursuit and coverage skills. In 2024 at California, he recorded 80 tackles, 3 sacks, and an 84.8 PFF coverage grade, effective against tight ends and running backs. His 6'3\", 235-lb frame and 4.65 speed provide range (7.0% missed tackle rate). Jock’s run defense (80.5 PFF grade) needs added physicality. A former three-star recruit, he projects as a Day 3 2026 pick with WILL or special teams upside."
    },
    {
        "name": "Akheem Mesidor",
        "position": "DT",
        "team": "Miami (FL)",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Cam Miller",
        "position": "CB",
        "team": "Rutgers",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Darian Mensah",
        "position": "CB",
        "team": "Duke",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Justin Joly",
        "position": "TE",
        "team": "TCU",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Donavon Greene",
        "position": "WR",
        "team": "Virginia Tech",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Rashad Battle",
        "position": "CB",
        "team": "Pittsburgh",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Isaiah World",
        "position": "OT",
        "team": "Oregon",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Pryce Yates",
        "position": "EDGE",
        "team": "North Carolina",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Ryan Lengyel",
        "position": "OG",
        "team": "Baylor",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Koluin'u Faaiu",
        "position": "OC",
        "team": "Texas A&M",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Trey White",
        "position": "EDGE",
        "team": "San Diego State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Logan Loya",
        "position": "WR",
        "team": "Minnesota",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Keith Abney II",
        "position": "CB",
        "team": "Arizona State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Miller Moss",
        "position": "QB",
        "team": "Louisville",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Lance Heard",
        "position": "OT",
        "team": "Tennessee",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Kyle Scott",
        "position": "CB",
        "team": "Arizona State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Aiden Fisher",
        "position": "LB",
        "team": "Indiana",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "D'Marion McCoy",
        "position": "CB",
        "team": "Boise State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Seydou Traore",
        "position": "TE",
        "team": "Mississippi State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Daylan Carnell",
        "position": "S",
        "team": "Missouri",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Joshua Josephs",
        "position": "EDGE",
        "team": "Tennessee",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "James Smith",
        "position": "DT",
        "team": "Alabama",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Duce Robinson",
        "position": "WR",
        "team": "Florida State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Luke Altmyer",
        "position": "QB",
        "team": "Illinois",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Mohamed Toure",
        "position": "LB",
        "team": "Rutgers",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jayden Maiava",
        "position": "QB",
        "team": "USC",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Walk Benson",
        "position": "RB",
        "team": "Oregon",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Christen Miller",
        "position": "DT",
        "team": "Georgia",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Nyland Green",
        "position": "CB",
        "team": "Arizona State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Matthew Bedford",
        "position": "OG",
        "team": "Oregon",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "A.J. Harris",
        "position": "CB",
        "team": "Penn State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Mark Gronowski",
        "position": "QB",
        "team": "Iowa",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jax Harrington",
        "position": "OG",
        "team": "Louisiana",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Teitum Tuioti",
        "position": "EDGE",
        "team": "Oregon",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Bryce Lance",
        "position": "WR",
        "team": "North Dakota State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jaden Greathouse",
        "position": "WR",
        "team": "Notre Dame",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Corey Walker",
        "position": "DT",
        "team": "Wisconsin",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Miles Kittsman",
        "position": "TE",
        "team": "Tennessee",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Xavion Alford",
        "position": "S",
        "team": "Arizona State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Tamon Lynum",
        "position": "CB",
        "team": "Pittsburgh",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "TJ Bush Jr.",
        "position": "EDGE",
        "team": "California",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Suntarine Perkins",
        "position": "LB",
        "team": "Ole Miss",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Sawyer Robertson",
        "position": "QB",
        "team": "Baylor",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jared Brown",
        "position": "WR",
        "team": "South Carolina",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jah-Marien Latham",
        "position": "DT",
        "team": "Alabama",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "CJ Davis",
        "position": "OT",
        "team": "Illinois",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Noah Fifita",
        "position": "QB",
        "team": "Arizona",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jamal Haynes",
        "position": "RB",
        "team": "Georgia Tech",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Al'zillion Hamilton",
        "position": "CB",
        "team": "Fresno State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Javon McIntyre",
        "position": "S",
        "team": "Pittsburgh",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Aaron Anderson",
        "position": "WR",
        "team": "LSU",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Chandler Rivers",
        "position": "CB",
        "team": "Duke",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Zxavian Harris",
        "position": "DT",
        "team": "Ole Miss",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Ethan Burke",
        "position": "EDGE",
        "team": "Texas",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "DJ Harvey",
        "position": "CB",
        "team": "USC",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jaylon Braxton",
        "position": "CB",
        "team": "Ole Miss",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jalen Moss",
        "position": "WR",
        "team": "Arizona State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jordan Castell",
        "position": "S",
        "team": "Florida",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Kyron Drones",
        "position": "QB",
        "team": "Virginia Tech",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Alex Afari Jr.",
        "position": "LB",
        "team": "Kentucky",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Alexander Whitmore",
        "position": "DT",
        "team": "UNLV",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jimmy Scott",
        "position": "EDGE",
        "team": "Pittsburgh",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Davion Carter",
        "position": "OG",
        "team": "Texas Tech",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Ja'Mori Maclin",
        "position": "WR",
        "team": "Kentucky",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Phillip Dunham",
        "position": "S",
        "team": "UCF",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Kobe Singleton",
        "position": "CB",
        "team": "Oregon State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Kevin Coleman Jr.",
        "position": "WR",
        "team": "Missouri",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jabari Mack",
        "position": "CB",
        "team": "Louisville",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Damieon George Jr.",
        "position": "OG",
        "team": "Florida",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Samuel Okunlola",
        "position": "EDGE",
        "team": "Colorado",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Ryan Linthicum",
        "position": "OC",
        "team": "Clemson",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Isaiah Nwokobia",
        "position": "S",
        "team": "SMU",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Triston Newson",
        "position": "LB",
        "team": "Missouri",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Haynes King",
        "position": "QB",
        "team": "Georgia Tech",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Christian Ellis",
        "position": "CB",
        "team": "Virginia Tech",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Bryan Thomas Jr.",
        "position": "EDGE",
        "team": "South Carolina",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "James Thompson Jr.",
        "position": "DT",
        "team": "Illinois",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Andrew Simpson",
        "position": "LB",
        "team": "Boise State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Rex Connors",
        "position": "S",
        "team": "UC Davis",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Demond Claiborne",
        "position": "RB",
        "team": "Wake Forest",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Will Pauling",
        "position": "WR",
        "team": "Notre Dame",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Josh Moten",
        "position": "CB",
        "team": "Southern Miss",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Matthew McDoom",
        "position": "CB",
        "team": "Cincinnati",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Nikhai Hill-Green",
        "position": "LB",
        "team": "Alabama",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "SJ Payne",
        "position": "S",
        "team": "Kansas State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Dante Dowdell",
        "position": "RB",
        "team": "Kentucky",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Maalik Murphy",
        "position": "QB",
        "team": "Oregon State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jalen Walthall",
        "position": "WR",
        "team": "Incarnate Word",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Ashton Garbacik",
        "position": "OG",
        "team": "Florida A&M",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Travali Price",
        "position": "DT",
        "team": "NC State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jahron Manning",
        "position": "S",
        "team": "Mississippi State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Brett Norfleet",
        "position": "TE",
        "team": "Missouri",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Eric O'Neill",
        "position": "EDGE",
        "team": "Rutgers",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Chase Sowell",
        "position": "WR",
        "team": "Iowa State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Kobe Baynes",
        "position": "OG",
        "team": "Kansas",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Caleb Weaver",
        "position": "S",
        "team": "Duke",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Ansel Din-Mbuh",
        "position": "DT",
        "team": "TCU",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Nyzier Fourqurean",
        "position": "CB",
        "team": "Wisconsin",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Sean Brown",
        "position": "LB",
        "team": "NC State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Deion Burks",
        "position": "WR",
        "team": "Oklahoma",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Ahmaad Moses",
        "position": "S",
        "team": "SMU",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Wendell Moe Jr.",
        "position": "OG",
        "team": "Tennessee",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Dametrious Crownover",
        "position": "OT",
        "team": "Texas A&M",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Kenny Johnson",
        "position": "WR",
        "team": "Pittsburgh",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Damonic Williams",
        "position": "DT",
        "team": "Oklahoma",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Tony Grimes",
        "position": "CB",
        "team": "Purdue",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "George Gumbs",
        "position": "EDGE",
        "team": "Florida",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Kyndrich Breedlove",
        "position": "CB",
        "team": "Arizona State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Malachi Breland",
        "position": "OG",
        "team": "Memphis",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Dillon Bell",
        "position": "WR",
        "team": "Georgia",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Caden Veltkamp",
        "position": "QB",
        "team": "Florida Atlantic",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Ryan Baer",
        "position": "OT",
        "team": "Pittsburgh",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Kc Larson",
        "position": "LS",
        "team": "Utah State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Daniel Harris",
        "position": "CB",
        "team": "Georgia",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jordan White",
        "position": "OG",
        "team": "Vanderbilt",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Rocco Becht",
        "position": "QB",
        "team": "Iowa State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Terion Stewart",
        "position": "RB",
        "team": "Virginia Tech",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jerand Bradley",
        "position": "WR",
        "team": "Kansas State",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Keyron Crawford",
        "position": "EDGE",
        "team": "Auburn",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Jaden Mangham",
        "position": "S",
        "team": "Michigan",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Deuce Harmon",
        "position": "CB",
        "team": "SMU",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Tawfiq Thomas",
        "position": "DT",
        "team": "Colorado",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "Skyler Bell",
        "position": "WR",
        "team": "UConn",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    },
    {
        "name": "JQ Hardaway",
        "position": "CB",
        "team": "Kentucky",
        "stats": {
            "height": "",
            "weight": "",
            "40Time": ""
        },
        "rating": "",
        "scoutingReport": ""
    }
]